MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
extern volatile RXF6EIDLbits_t RXF6EIDLbits __at(0xE4B);
// bitfield macros
#define _RXF6EIDL_EID_POSN                                  0x0
#define _RXF6EIDL_EID_POSITION                              0x0
#define _RXF6EIDL_EID_SIZE                                  0x8
#define _RXF6EIDL_EID_LENGTH                                0x8
#define _RXF6EIDL_EID_MASK                                  0xFF
#define _RXF6EIDL_EID0_POSN                                 0x0
#define _RXF6EIDL_EID0_POSITION                             0x0
#define _RXF6EIDL_EID0_SIZE                                 0x1
#define _RXF6EIDL_EID0_LENGTH                               0x1
#define _RXF6EIDL_EID0_MASK                                 0x1
#define _RXF6EIDL_EID1_POSN                                 0x1
#define _RXF6EIDL_EID1_POSITION                             0x1
#define _RXF6EIDL_EID1_SIZE                                 0x1
#define _RXF6EIDL_EID1_LENGTH                               0x1
#define _RXF6EIDL_EID1_MASK                                 0x2
#define _RXF6EIDL_EID2_POSN                                 0x2
#define _RXF6EIDL_EID2_POSITION                             0x2
#define _RXF6EIDL_EID2_SIZE                                 0x1
#define _RXF6EIDL_EID2_LENGTH                               0x1
#define _RXF6EIDL_EID2_MASK                                 0x4
#define _RXF6EIDL_EID3_POSN                                 0x3
#define _RXF6EIDL_EID3_POSITION                             0x3
#define _RXF6EIDL_EID3_SIZE                                 0x1
#define _RXF6EIDL_EID3_LENGTH                               0x1
#define _RXF6EIDL_EID3_MASK                                 0x8
#define _RXF6EIDL_EID4_POSN                                 0x4
#define _RXF6EIDL_EID4_POSITION                             0x4
#define _RXF6EIDL_EID4_SIZE                                 0x1
#define _RXF6EIDL_EID4_LENGTH                               0x1
#define _RXF6EIDL_EID4_MASK                                 0x10
#define _RXF6EIDL_EID5_POSN                                 0x5
#define _RXF6EIDL_EID5_POSITION                             0x5
#define _RXF6EIDL_EID5_SIZE                                 0x1
#define _RXF6EIDL_EID5_LENGTH                               0x1
#define _RXF6EIDL_EID5_MASK                                 0x20
#define _RXF6EIDL_EID6_POSN                                 0x6
#define _RXF6EIDL_EID6_POSITION                             0x6
#define _RXF6EIDL_EID6_SIZE                                 0x1
#define _RXF6EIDL_EID6_LENGTH                               0x1
#define _RXF6EIDL_EID6_MASK                                 0x40
#define _RXF6EIDL_EID7_POSN                                 0x7
#define _RXF6EIDL_EID7_POSITION                             0x7
#define _RXF6EIDL_EID7_SIZE                                 0x1
#define _RXF6EIDL_EID7_LENGTH                               0x1
#define _RXF6EIDL_EID7_MASK                                 0x80
#define _RXF6EIDL_RXF6EID0_POSN                             0x0
#define _RXF6EIDL_RXF6EID0_POSITION                         0x0
#define _RXF6EIDL_RXF6EID0_SIZE                             0x1
#define _RXF6EIDL_RXF6EID0_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID0_MASK                             0x1
#define _RXF6EIDL_RXF6EID1_POSN                             0x1
#define _RXF6EIDL_RXF6EID1_POSITION                         0x1
#define _RXF6EIDL_RXF6EID1_SIZE                             0x1
#define _RXF6EIDL_RXF6EID1_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID1_MASK                             0x2
#define _RXF6EIDL_RXF6EID2_POSN                             0x2
#define _RXF6EIDL_RXF6EID2_POSITION                         0x2
#define _RXF6EIDL_RXF6EID2_SIZE                             0x1
#define _RXF6EIDL_RXF6EID2_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID2_MASK                             0x4
#define _RXF6EIDL_RXF6EID3_POSN                             0x3
#define _RXF6EIDL_RXF6EID3_POSITION                         0x3
#define _RXF6EIDL_RXF6EID3_SIZE                             0x1
#define _RXF6EIDL_RXF6EID3_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID3_MASK                             0x8
#define _RXF6EIDL_RXF6EID4_POSN                             0x4
#define _RXF6EIDL_RXF6EID4_POSITION                         0x4
#define _RXF6EIDL_RXF6EID4_SIZE                             0x1
#define _RXF6EIDL_RXF6EID4_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID4_MASK                             0x10
#define _RXF6EIDL_RXF6EID5_POSN                             0x5
#define _RXF6EIDL_RXF6EID5_POSITION                         0x5
#define _RXF6EIDL_RXF6EID5_SIZE                             0x1
#define _RXF6EIDL_RXF6EID5_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID5_MASK                             0x20
#define _RXF6EIDL_RXF6EID6_POSN                             0x6
#define _RXF6EIDL_RXF6EID6_POSITION                         0x6
#define _RXF6EIDL_RXF6EID6_SIZE                             0x1
#define _RXF6EIDL_RXF6EID6_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID6_MASK                             0x40
#define _RXF6EIDL_RXF6EID7_POSN                             0x7
#define _RXF6EIDL_RXF6EID7_POSITION                         0x7
#define _RXF6EIDL_RXF6EID7_SIZE                             0x1
#define _RXF6EIDL_RXF6EID7_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID7_MASK                             0x80

// Register: RXF7SIDH
#define RXF7SIDH RXF7SIDH
extern volatile unsigned char           RXF7SIDH            __at(0xE4C);
#ifndef _LIB_BUILD
asm("RXF7SIDH equ 0E4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF7SID3               :1;
        unsigned RXF7SID4               :1;
        unsigned RXF7SID5               :1;
        unsigned RXF7SID6               :1;
        unsigned RXF7SID7               :1;
        unsigned RXF7SID8               :1;
        unsigned RXF7SID9               :1;
        unsigned RXF7SID10              :1;
    };
} RXF7SIDHbits_t;
extern volatile RXF7SIDHbits_t RXF7SIDHbits __at(0xE4C);
// bitfield macros
#define _RXF7SIDH_SID_POSN                                  0x0
#define _RXF7SIDH_SID_POSITION                              0x0
#define _RXF7SIDH_SID_SIZE                                  0x8
#define _RXF7SIDH_SID_LENGTH                                0x8
#define _RXF7SIDH_SID_MASK                                  0xFF
#define _RXF7SIDH_SID3_POSN                                 0x0
#define _RXF7SIDH_SID3_POSITION                             0x0
#define _RXF7SIDH_SID3_SIZE                                 0x1
#define _RXF7SIDH_SID3_LENGTH                               0x1
#define _RXF7SIDH_SID3_MASK                                 0x1
#define _RXF7SIDH_SID4_POSN                                 0x1
#define _RXF7SIDH_SID4_POSITION                             0x1
#define _RXF7SIDH_SID4_SIZE                                 0x1
#define _RXF7SIDH_SID4_LENGTH                               0x1
#define _RXF7SIDH_SID4_MASK                                 0x2
#define _RXF7SIDH_SID5_POSN                                 0x2
#define _RXF7SIDH_SID5_POSITION                             0x2
#define _RXF7SIDH_SID5_SIZE                                 0x1
#define _RXF7SIDH_SID5_LENGTH                               0x1
#define _RXF7SIDH_SID5_MASK                                 0x4
#define _RXF7SIDH_SID6_POSN                                 0x3
#define _RXF7SIDH_SID6_POSITION                             0x3
#define _RXF7SIDH_SID6_SIZE                                 0x1
#define _RXF7SIDH_SID6_LENGTH                               0x1
#define _RXF7SIDH_SID6_MASK                                 0x8
#define _RXF7SIDH_SID7_POSN                                 0x4
#define _RXF7SIDH_SID7_POSITION                             0x4
#define _RXF7SIDH_SID7_SIZE                                 0x1
#define _RXF7SIDH_SID7_LENGTH                               0x1
#define _RXF7SIDH_SID7_MASK                                 0x10
#define _RXF7SIDH_SID8_POSN                                 0x5
#define _RXF7SIDH_SID8_POSITION                             0x5
#define _RXF7SIDH_SID8_SIZE                                 0x1
#define _RXF7SIDH_SID8_LENGTH                               0x1
#define _RXF7SIDH_SID8_MASK                                 0x20
#define _RXF7SIDH_SID9_POSN                                 0x6
#define _RXF7SIDH_SID9_POSITION                             0x6
#define _RXF7SIDH_SID9_SIZE                                 0x1
#define _RXF7SIDH_SID9_LENGTH                               0x1
#define _RXF7SIDH_SID9_MASK                                 0x40
#define _RXF7SIDH_SID10_POSN                                0x7
#define _RXF7SIDH_SID10_POSITION                            0x7
#define _RXF7SIDH_SID10_SIZE                                0x1
#define _RXF7SIDH_SID10_LENGTH                              0x1
#define _RXF7SIDH_SID10_MASK                                0x80
#define _RXF7SIDH_RXF7SID3_POSN                             0x0
#define _RXF7SIDH_RXF7SID3_POSITION                         0x0
#define _RXF7SIDH_RXF7SID3_SIZE                             0x1
#define _RXF7SIDH_RXF7SID3_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID3_MASK                             0x1
#define _RXF7SIDH_RXF7SID4_POSN                             0x1
#define _RXF7SIDH_RXF7SID4_POSITION                         0x1
#define _RXF7SIDH_RXF7SID4_SIZE                             0x1
#define _RXF7SIDH_RXF7SID4_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID4_MASK                             0x2
#define _RXF7SIDH_RXF7SID5_POSN                             0x2
#define _RXF7SIDH_RXF7SID5_POSITION                         0x2
#define _RXF7SIDH_RXF7SID5_SIZE                             0x1
#define _RXF7SIDH_RXF7SID5_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID5_MASK                             0x4
#define _RXF7SIDH_RXF7SID6_POSN                             0x3
#define _RXF7SIDH_RXF7SID6_POSITION                         0x3
#define _RXF7SIDH_RXF7SID6_SIZE                             0x1
#define _RXF7SIDH_RXF7SID6_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID6_MASK                             0x8
#define _RXF7SIDH_RXF7SID7_POSN                             0x4
#define _RXF7SIDH_RXF7SID7_POSITION                         0x4
#define _RXF7SIDH_RXF7SID7_SIZE                             0x1
#define _RXF7SIDH_RXF7SID7_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID7_MASK                             0x10
#define _RXF7SIDH_RXF7SID8_POSN                             0x5
#define _RXF7SIDH_RXF7SID8_POSITION                         0x5
#define _RXF7SIDH_RXF7SID8_SIZE                             0x1
#define _RXF7SIDH_RXF7SID8_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID8_MASK                             0x20
#define _RXF7SIDH_RXF7SID9_POSN                             0x6
#define _RXF7SIDH_RXF7SID9_POSITION                         0x6
#define _RXF7SIDH_RXF7SID9_SIZE                             0x1
#define _RXF7SIDH_RXF7SID9_LENGTH                           0x1
#define _RXF7SIDH_RXF7SID9_MASK                             0x40
#define _RXF7SIDH_RXF7SID10_POSN                            0x7
#define _RXF7SIDH_RXF7SID10_POSITION                        0x7
#define _RXF7SIDH_RXF7SID10_SIZE                            0x1
#define _RXF7SIDH_RXF7SID10_LENGTH                          0x1
#define _RXF7SIDH_RXF7SID10_MASK                            0x80

// Register: RXF7SIDL
#define RXF7SIDL RXF7SIDL
extern volatile unsigned char           RXF7SIDL            __at(0xE4D);
#ifndef _LIB_BUILD
asm("RXF7SIDL equ 0E4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF7EID16              :1;
        unsigned RXF7EID17              :1;
        unsigned                        :1;
        unsigned RXF7EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF7SID0               :1;
        unsigned RXF7SID1               :1;
        unsigned RXF7SID2               :1;
    };
} RXF7SIDLbits_t;
extern volatile RXF7SIDLbits_t RXF7SIDLbits __at(0xE4D);
// bitfield macros
#define _RXF7SIDL_EID_POSN                                  0x0
#define _RXF7SIDL_EID_POSITION                              0x0
#define _RXF7SIDL_EID_SIZE                                  0x2
#define _RXF7SIDL_EID_LENGTH                                0x2
#define _RXF7SIDL_EID_MASK                                  0x3
#define _RXF7SIDL_EXIDEN_POSN                               0x3
#define _RXF7SIDL_EXIDEN_POSITION                           0x3
#define _RXF7SIDL_EXIDEN_SIZE                               0x1
#define _RXF7SIDL_EXIDEN_LENGTH                             0x1
#define _RXF7SIDL_EXIDEN_MASK                               0x8
#define _RXF7SIDL_SID_POSN                                  0x5
#define _RXF7SIDL_SID_POSITION                              0x5
#define _RXF7SIDL_SID_SIZE                                  0x3
#define _RXF7SIDL_SID_LENGTH                                0x3
#define _RXF7SIDL_SID_MASK                                  0xE0
#define _RXF7SIDL_EID16_POSN                                0x0
#define _RXF7SIDL_EID16_POSITION                            0x0
#define _RXF7SIDL_EID16_SIZE                                0x1
#define _RXF7SIDL_EID16_LENGTH                              0x1
#define _RXF7SIDL_EID16_MASK                                0x1
#define _RXF7SIDL_EID17_POSN                                0x1
#define _RXF7SIDL_EID17_POSITION                            0x1
#define _RXF7SIDL_EID17_SIZE                                0x1
#define _RXF7SIDL_EID17_LENGTH                              0x1
#define _RXF7SIDL_EID17_MASK                                0x2
#define _RXF7SIDL_SID0_POSN                                 0x5
#define _RXF7SIDL_SID0_POSITION                             0x5
#define _RXF7SIDL_SID0_SIZE                                 0x1
#define _RXF7SIDL_SID0_LENGTH                               0x1
#define _RXF7SIDL_SID0_MASK                                 0x20
#define _RXF7SIDL_SID1_POSN                                 0x6
#define _RXF7SIDL_SID1_POSITION                             0x6
#define _RXF7SIDL_SID1_SIZE                                 0x1
#define _RXF7SIDL_SID1_LENGTH                               0x1
#define _RXF7SIDL_SID1_MASK                                 0x40
#define _RXF7SIDL_SID2_POSN                                 0x7
#define _RXF7SIDL_SID2_POSITION                             0x7
#define _RXF7SIDL_SID2_SIZE                                 0x1
#define _RXF7SIDL_SID2_LENGTH                               0x1
#define _RXF7SIDL_SID2_MASK                                 0x80
#define _RXF7SIDL_RXF7EID16_POSN                            0x0
#define _RXF7SIDL_RXF7EID16_POSITION                        0x0
#define _RXF7SIDL_RXF7EID16_SIZE                            0x1
#define _RXF7SIDL_RXF7EID16_LENGTH                          0x1
#define _RXF7SIDL_RXF7EID16_MASK                            0x1
#define _RXF7SIDL_RXF7EID17_POSN                            0x1
#define _RXF7SIDL_RXF7EID17_POSITION                        0x1
#define _RXF7SIDL_RXF7EID17_SIZE                            0x1
#define _RXF7SIDL_RXF7EID17_LENGTH                          0x1
#define _RXF7SIDL_RXF7EID17_MASK                            0x2
#define _RXF7SIDL_RXF7EXIDEN_POSN                           0x3
#define _RXF7SIDL_RXF7EXIDEN_POSITION                       0x3
#define _RXF7SIDL_RXF7EXIDEN_SIZE                           0x1
#define _RXF7SIDL_RXF7EXIDEN_LENGTH                         0x1
#define _RXF7SIDL_RXF7EXIDEN_MASK                           0x8
#define _RXF7SIDL_RXF7SID0_POSN                             0x5
#define _RXF7SIDL_RXF7SID0_POSITION                         0x5
#define _RXF7SIDL_RXF7SID0_SIZE                             0x1
#define _RXF7SIDL_RXF7SID0_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID0_MASK                             0x20
#define _RXF7SIDL_RXF7SID1_POSN                             0x6
#define _RXF7SIDL_RXF7SID1_POSITION                         0x6
#define _RXF7SIDL_RXF7SID1_SIZE                             0x1
#define _RXF7SIDL_RXF7SID1_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID1_MASK                             0x40
#define _RXF7SIDL_RXF7SID2_POSN                             0x7
#define _RXF7SIDL_RXF7SID2_POSITION                         0x7
#define _RXF7SIDL_RXF7SID2_SIZE                             0x1
#define _RXF7SIDL_RXF7SID2_LENGTH                           0x1
#define _RXF7SIDL_RXF7SID2_MASK                             0x80

// Register: RXF7EIDH
#define RXF7EIDH RXF7EIDH
extern volatile unsigned char           RXF7EIDH            __at(0xE4E);
#ifndef _LIB_BUILD
asm("RXF7EIDH equ 0E4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF7EID8               :1;
        unsigned RXF7EID9               :1;
        unsigned RXF7EID10              :1;
        unsigned RXF7EID11              :1;
        unsigned RXF7EID12              :1;
        unsigned RXF7EID13              :1;
        unsigned RXF7EID14              :1;
        unsigned RXF7EID15              :1;
    };
} RXF7EIDHbits_t;
