MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
extern volatile RXF12SIDHbits_t RXF12SIDHbits __at(0xE60);
// bitfield macros
#define _RXF12SIDH_SID_POSN                                 0x0
#define _RXF12SIDH_SID_POSITION                             0x0
#define _RXF12SIDH_SID_SIZE                                 0x8
#define _RXF12SIDH_SID_LENGTH                               0x8
#define _RXF12SIDH_SID_MASK                                 0xFF
#define _RXF12SIDH_SID3_POSN                                0x0
#define _RXF12SIDH_SID3_POSITION                            0x0
#define _RXF12SIDH_SID3_SIZE                                0x1
#define _RXF12SIDH_SID3_LENGTH                              0x1
#define _RXF12SIDH_SID3_MASK                                0x1
#define _RXF12SIDH_SID4_POSN                                0x1
#define _RXF12SIDH_SID4_POSITION                            0x1
#define _RXF12SIDH_SID4_SIZE                                0x1
#define _RXF12SIDH_SID4_LENGTH                              0x1
#define _RXF12SIDH_SID4_MASK                                0x2
#define _RXF12SIDH_SID5_POSN                                0x2
#define _RXF12SIDH_SID5_POSITION                            0x2
#define _RXF12SIDH_SID5_SIZE                                0x1
#define _RXF12SIDH_SID5_LENGTH                              0x1
#define _RXF12SIDH_SID5_MASK                                0x4
#define _RXF12SIDH_SID6_POSN                                0x3
#define _RXF12SIDH_SID6_POSITION                            0x3
#define _RXF12SIDH_SID6_SIZE                                0x1
#define _RXF12SIDH_SID6_LENGTH                              0x1
#define _RXF12SIDH_SID6_MASK                                0x8
#define _RXF12SIDH_SID7_POSN                                0x4
#define _RXF12SIDH_SID7_POSITION                            0x4
#define _RXF12SIDH_SID7_SIZE                                0x1
#define _RXF12SIDH_SID7_LENGTH                              0x1
#define _RXF12SIDH_SID7_MASK                                0x10
#define _RXF12SIDH_SID8_POSN                                0x5
#define _RXF12SIDH_SID8_POSITION                            0x5
#define _RXF12SIDH_SID8_SIZE                                0x1
#define _RXF12SIDH_SID8_LENGTH                              0x1
#define _RXF12SIDH_SID8_MASK                                0x20
#define _RXF12SIDH_SID9_POSN                                0x6
#define _RXF12SIDH_SID9_POSITION                            0x6
#define _RXF12SIDH_SID9_SIZE                                0x1
#define _RXF12SIDH_SID9_LENGTH                              0x1
#define _RXF12SIDH_SID9_MASK                                0x40
#define _RXF12SIDH_SID10_POSN                               0x7
#define _RXF12SIDH_SID10_POSITION                           0x7
#define _RXF12SIDH_SID10_SIZE                               0x1
#define _RXF12SIDH_SID10_LENGTH                             0x1
#define _RXF12SIDH_SID10_MASK                               0x80
#define _RXF12SIDH_RXF12SID3_POSN                           0x0
#define _RXF12SIDH_RXF12SID3_POSITION                       0x0
#define _RXF12SIDH_RXF12SID3_SIZE                           0x1
#define _RXF12SIDH_RXF12SID3_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID3_MASK                           0x1
#define _RXF12SIDH_RXF12SID4_POSN                           0x1
#define _RXF12SIDH_RXF12SID4_POSITION                       0x1
#define _RXF12SIDH_RXF12SID4_SIZE                           0x1
#define _RXF12SIDH_RXF12SID4_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID4_MASK                           0x2
#define _RXF12SIDH_RXF12SID5_POSN                           0x2
#define _RXF12SIDH_RXF12SID5_POSITION                       0x2
#define _RXF12SIDH_RXF12SID5_SIZE                           0x1
#define _RXF12SIDH_RXF12SID5_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID5_MASK                           0x4
#define _RXF12SIDH_RXF12SID6_POSN                           0x3
#define _RXF12SIDH_RXF12SID6_POSITION                       0x3
#define _RXF12SIDH_RXF12SID6_SIZE                           0x1
#define _RXF12SIDH_RXF12SID6_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID6_MASK                           0x8
#define _RXF12SIDH_RXF12SID7_POSN                           0x4
#define _RXF12SIDH_RXF12SID7_POSITION                       0x4
#define _RXF12SIDH_RXF12SID7_SIZE                           0x1
#define _RXF12SIDH_RXF12SID7_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID7_MASK                           0x10
#define _RXF12SIDH_RXF12SID8_POSN                           0x5
#define _RXF12SIDH_RXF12SID8_POSITION                       0x5
#define _RXF12SIDH_RXF12SID8_SIZE                           0x1
#define _RXF12SIDH_RXF12SID8_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID8_MASK                           0x20
#define _RXF12SIDH_RXF12SID9_POSN                           0x6
#define _RXF12SIDH_RXF12SID9_POSITION                       0x6
#define _RXF12SIDH_RXF12SID9_SIZE                           0x1
#define _RXF12SIDH_RXF12SID9_LENGTH                         0x1
#define _RXF12SIDH_RXF12SID9_MASK                           0x40
#define _RXF12SIDH_RXF12SID10_POSN                          0x7
#define _RXF12SIDH_RXF12SID10_POSITION                      0x7
#define _RXF12SIDH_RXF12SID10_SIZE                          0x1
#define _RXF12SIDH_RXF12SID10_LENGTH                        0x1
#define _RXF12SIDH_RXF12SID10_MASK                          0x80

// Register: RXF12SIDL
#define RXF12SIDL RXF12SIDL
extern volatile unsigned char           RXF12SIDL           __at(0xE61);
#ifndef _LIB_BUILD
asm("RXF12SIDL equ 0E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF12EID16             :1;
        unsigned RXF12EID17             :1;
        unsigned                        :1;
        unsigned RXF12EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF12SID0              :1;
        unsigned RXF12SID1              :1;
        unsigned RXF12SID2              :1;
    };
} RXF12SIDLbits_t;
extern volatile RXF12SIDLbits_t RXF12SIDLbits __at(0xE61);
// bitfield macros
#define _RXF12SIDL_EID_POSN                                 0x0
#define _RXF12SIDL_EID_POSITION                             0x0
#define _RXF12SIDL_EID_SIZE                                 0x2
#define _RXF12SIDL_EID_LENGTH                               0x2
#define _RXF12SIDL_EID_MASK                                 0x3
#define _RXF12SIDL_EXIDEN_POSN                              0x3
#define _RXF12SIDL_EXIDEN_POSITION                          0x3
#define _RXF12SIDL_EXIDEN_SIZE                              0x1
#define _RXF12SIDL_EXIDEN_LENGTH                            0x1
#define _RXF12SIDL_EXIDEN_MASK                              0x8
#define _RXF12SIDL_SID_POSN                                 0x5
#define _RXF12SIDL_SID_POSITION                             0x5
#define _RXF12SIDL_SID_SIZE                                 0x3
#define _RXF12SIDL_SID_LENGTH                               0x3
#define _RXF12SIDL_SID_MASK                                 0xE0
#define _RXF12SIDL_EID16_POSN                               0x0
#define _RXF12SIDL_EID16_POSITION                           0x0
#define _RXF12SIDL_EID16_SIZE                               0x1
#define _RXF12SIDL_EID16_LENGTH                             0x1
#define _RXF12SIDL_EID16_MASK                               0x1
#define _RXF12SIDL_EID17_POSN                               0x1
#define _RXF12SIDL_EID17_POSITION                           0x1
#define _RXF12SIDL_EID17_SIZE                               0x1
#define _RXF12SIDL_EID17_LENGTH                             0x1
#define _RXF12SIDL_EID17_MASK                               0x2
#define _RXF12SIDL_SID0_POSN                                0x5
#define _RXF12SIDL_SID0_POSITION                            0x5
#define _RXF12SIDL_SID0_SIZE                                0x1
#define _RXF12SIDL_SID0_LENGTH                              0x1
#define _RXF12SIDL_SID0_MASK                                0x20
#define _RXF12SIDL_SID1_POSN                                0x6
#define _RXF12SIDL_SID1_POSITION                            0x6
#define _RXF12SIDL_SID1_SIZE                                0x1
#define _RXF12SIDL_SID1_LENGTH                              0x1
#define _RXF12SIDL_SID1_MASK                                0x40
#define _RXF12SIDL_SID2_POSN                                0x7
#define _RXF12SIDL_SID2_POSITION                            0x7
#define _RXF12SIDL_SID2_SIZE                                0x1
#define _RXF12SIDL_SID2_LENGTH                              0x1
#define _RXF12SIDL_SID2_MASK                                0x80
#define _RXF12SIDL_RXF12EID16_POSN                          0x0
#define _RXF12SIDL_RXF12EID16_POSITION                      0x0
#define _RXF12SIDL_RXF12EID16_SIZE                          0x1
#define _RXF12SIDL_RXF12EID16_LENGTH                        0x1
#define _RXF12SIDL_RXF12EID16_MASK                          0x1
#define _RXF12SIDL_RXF12EID17_POSN                          0x1
#define _RXF12SIDL_RXF12EID17_POSITION                      0x1
#define _RXF12SIDL_RXF12EID17_SIZE                          0x1
#define _RXF12SIDL_RXF12EID17_LENGTH                        0x1
#define _RXF12SIDL_RXF12EID17_MASK                          0x2
#define _RXF12SIDL_RXF12EXIDEN_POSN                         0x3
#define _RXF12SIDL_RXF12EXIDEN_POSITION                     0x3
#define _RXF12SIDL_RXF12EXIDEN_SIZE                         0x1
#define _RXF12SIDL_RXF12EXIDEN_LENGTH                       0x1
#define _RXF12SIDL_RXF12EXIDEN_MASK                         0x8
#define _RXF12SIDL_RXF12SID0_POSN                           0x5
#define _RXF12SIDL_RXF12SID0_POSITION                       0x5
#define _RXF12SIDL_RXF12SID0_SIZE                           0x1
#define _RXF12SIDL_RXF12SID0_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID0_MASK                           0x20
#define _RXF12SIDL_RXF12SID1_POSN                           0x6
#define _RXF12SIDL_RXF12SID1_POSITION                       0x6
#define _RXF12SIDL_RXF12SID1_SIZE                           0x1
#define _RXF12SIDL_RXF12SID1_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID1_MASK                           0x40
#define _RXF12SIDL_RXF12SID2_POSN                           0x7
#define _RXF12SIDL_RXF12SID2_POSITION                       0x7
#define _RXF12SIDL_RXF12SID2_SIZE                           0x1
#define _RXF12SIDL_RXF12SID2_LENGTH                         0x1
#define _RXF12SIDL_RXF12SID2_MASK                           0x80

// Register: RXF12EIDH
#define RXF12EIDH RXF12EIDH
extern volatile unsigned char           RXF12EIDH           __at(0xE62);
#ifndef _LIB_BUILD
asm("RXF12EIDH equ 0E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF12EID8              :1;
        unsigned RXF12EID9              :1;
        unsigned RXF12EID10             :1;
        unsigned RXF12EID11             :1;
        unsigned RXF12EID12             :1;
        unsigned RXF12EID13             :1;
        unsigned RXF12EID14             :1;
        unsigned RXF12EID15             :1;
    };
} RXF12EIDHbits_t;
extern volatile RXF12EIDHbits_t RXF12EIDHbits __at(0xE62);
// bitfield macros
#define _RXF12EIDH_EID_POSN                                 0x0
#define _RXF12EIDH_EID_POSITION                             0x0
#define _RXF12EIDH_EID_SIZE                                 0x8
#define _RXF12EIDH_EID_LENGTH                               0x8
#define _RXF12EIDH_EID_MASK                                 0xFF
#define _RXF12EIDH_EID8_POSN                                0x0
#define _RXF12EIDH_EID8_POSITION                            0x0
#define _RXF12EIDH_EID8_SIZE                                0x1
#define _RXF12EIDH_EID8_LENGTH                              0x1
#define _RXF12EIDH_EID8_MASK                                0x1
#define _RXF12EIDH_EID9_POSN                                0x1
#define _RXF12EIDH_EID9_POSITION                            0x1
#define _RXF12EIDH_EID9_SIZE                                0x1
#define _RXF12EIDH_EID9_LENGTH                              0x1
#define _RXF12EIDH_EID9_MASK                                0x2
#define _RXF12EIDH_EID10_POSN                               0x2
#define _RXF12EIDH_EID10_POSITION                           0x2
#define _RXF12EIDH_EID10_SIZE                               0x1
#define _RXF12EIDH_EID10_LENGTH                             0x1
#define _RXF12EIDH_EID10_MASK                               0x4
#define _RXF12EIDH_EID11_POSN                               0x3
#define _RXF12EIDH_EID11_POSITION                           0x3
#define _RXF12EIDH_EID11_SIZE                               0x1
#define _RXF12EIDH_EID11_LENGTH                             0x1
#define _RXF12EIDH_EID11_MASK                               0x8
#define _RXF12EIDH_EID12_POSN                               0x4
#define _RXF12EIDH_EID12_POSITION                           0x4
#define _RXF12EIDH_EID12_SIZE                               0x1
#define _RXF12EIDH_EID12_LENGTH                             0x1
#define _RXF12EIDH_EID12_MASK                               0x10
#define _RXF12EIDH_EID13_POSN                               0x5
#define _RXF12EIDH_EID13_POSITION                           0x5
#define _RXF12EIDH_EID13_SIZE                               0x1
#define _RXF12EIDH_EID13_LENGTH                             0x1
#define _RXF12EIDH_EID13_MASK                               0x20
#define _RXF12EIDH_EID14_POSN                               0x6
#define _RXF12EIDH_EID14_POSITION                           0x6
#define _RXF12EIDH_EID14_SIZE                               0x1
#define _RXF12EIDH_EID14_LENGTH                             0x1
#define _RXF12EIDH_EID14_MASK                               0x40
#define _RXF12EIDH_EID15_POSN                               0x7
#define _RXF12EIDH_EID15_POSITION                           0x7
#define _RXF12EIDH_EID15_SIZE                               0x1
#define _RXF12EIDH_EID15_LENGTH                             0x1
#define _RXF12EIDH_EID15_MASK                               0x80
#define _RXF12EIDH_RXF12EID8_POSN                           0x0
#define _RXF12EIDH_RXF12EID8_POSITION                       0x0
#define _RXF12EIDH_RXF12EID8_SIZE                           0x1
#define _RXF12EIDH_RXF12EID8_LENGTH                         0x1
#define _RXF12EIDH_RXF12EID8_MASK                           0x1
#define _RXF12EIDH_RXF12EID9_POSN                           0x1
#define _RXF12EIDH_RXF12EID9_POSITION                       0x1
#define _RXF12EIDH_RXF12EID9_SIZE                           0x1
#define _RXF12EIDH_RXF12EID9_LENGTH                         0x1
#define _RXF12EIDH_RXF12EID9_MASK                           0x2
#define _RXF12EIDH_RXF12EID10_POSN                          0x2
#define _RXF12EIDH_RXF12EID10_POSITION                      0x2
#define _RXF12EIDH_RXF12EID10_SIZE                          0x1
#define _RXF12EIDH_RXF12EID10_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID10_MASK                          0x4
#define _RXF12EIDH_RXF12EID11_POSN                          0x3
#define _RXF12EIDH_RXF12EID11_POSITION                      0x3
#define _RXF12EIDH_RXF12EID11_SIZE                          0x1
#define _RXF12EIDH_RXF12EID11_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID11_MASK                          0x8
#define _RXF12EIDH_RXF12EID12_POSN                          0x4
#define _RXF12EIDH_RXF12EID12_POSITION                      0x4
#define _RXF12EIDH_RXF12EID12_SIZE                          0x1
#define _RXF12EIDH_RXF12EID12_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID12_MASK                          0x10
#define _RXF12EIDH_RXF12EID13_POSN                          0x5
#define _RXF12EIDH_RXF12EID13_POSITION                      0x5
#define _RXF12EIDH_RXF12EID13_SIZE                          0x1
#define _RXF12EIDH_RXF12EID13_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID13_MASK                          0x20
#define _RXF12EIDH_RXF12EID14_POSN                          0x6
#define _RXF12EIDH_RXF12EID14_POSITION                      0x6
#define _RXF12EIDH_RXF12EID14_SIZE                          0x1
#define _RXF12EIDH_RXF12EID14_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID14_MASK                          0x40
#define _RXF12EIDH_RXF12EID15_POSN                          0x7
#define _RXF12EIDH_RXF12EID15_POSITION                      0x7
#define _RXF12EIDH_RXF12EID15_SIZE                          0x1
#define _RXF12EIDH_RXF12EID15_LENGTH                        0x1
#define _RXF12EIDH_RXF12EID15_MASK                          0x80

// Register: RXF12EIDL
#define RXF12EIDL RXF12EIDL
extern volatile unsigned char           RXF12EIDL           __at(0xE63);
#ifndef _LIB_BUILD
asm("RXF12EIDL equ 0E63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF12EID0              :1;
        unsigned RXF12EID1              :1;
        unsigned RXF12EID2              :1;
        unsigned RXF12EID3              :1;
        unsigned RXF12EID4              :1;
        unsigned RXF12EID5              :1;
        unsigned RXF12EID6              :1;
        unsigned RXF12EID7              :1;
    };
} RXF12EIDLbits_t;
