MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
extern volatile RXF15EIDHbits_t RXF15EIDHbits __at(0xE6E);
// bitfield macros
#define _RXF15EIDH_RXFEID_POSN                              0x0
#define _RXF15EIDH_RXFEID_POSITION                          0x0
#define _RXF15EIDH_RXFEID_SIZE                              0x8
#define _RXF15EIDH_RXFEID_LENGTH                            0x8
#define _RXF15EIDH_RXFEID_MASK                              0xFF
#define _RXF15EIDH_EID8_POSN                                0x0
#define _RXF15EIDH_EID8_POSITION                            0x0
#define _RXF15EIDH_EID8_SIZE                                0x1
#define _RXF15EIDH_EID8_LENGTH                              0x1
#define _RXF15EIDH_EID8_MASK                                0x1
#define _RXF15EIDH_EID9_POSN                                0x1
#define _RXF15EIDH_EID9_POSITION                            0x1
#define _RXF15EIDH_EID9_SIZE                                0x1
#define _RXF15EIDH_EID9_LENGTH                              0x1
#define _RXF15EIDH_EID9_MASK                                0x2
#define _RXF15EIDH_EID10_POSN                               0x2
#define _RXF15EIDH_EID10_POSITION                           0x2
#define _RXF15EIDH_EID10_SIZE                               0x1
#define _RXF15EIDH_EID10_LENGTH                             0x1
#define _RXF15EIDH_EID10_MASK                               0x4
#define _RXF15EIDH_EID11_POSN                               0x3
#define _RXF15EIDH_EID11_POSITION                           0x3
#define _RXF15EIDH_EID11_SIZE                               0x1
#define _RXF15EIDH_EID11_LENGTH                             0x1
#define _RXF15EIDH_EID11_MASK                               0x8
#define _RXF15EIDH_EID12_POSN                               0x4
#define _RXF15EIDH_EID12_POSITION                           0x4
#define _RXF15EIDH_EID12_SIZE                               0x1
#define _RXF15EIDH_EID12_LENGTH                             0x1
#define _RXF15EIDH_EID12_MASK                               0x10
#define _RXF15EIDH_EID13_POSN                               0x5
#define _RXF15EIDH_EID13_POSITION                           0x5
#define _RXF15EIDH_EID13_SIZE                               0x1
#define _RXF15EIDH_EID13_LENGTH                             0x1
#define _RXF15EIDH_EID13_MASK                               0x20
#define _RXF15EIDH_EID14_POSN                               0x6
#define _RXF15EIDH_EID14_POSITION                           0x6
#define _RXF15EIDH_EID14_SIZE                               0x1
#define _RXF15EIDH_EID14_LENGTH                             0x1
#define _RXF15EIDH_EID14_MASK                               0x40
#define _RXF15EIDH_EID15_POSN                               0x7
#define _RXF15EIDH_EID15_POSITION                           0x7
#define _RXF15EIDH_EID15_SIZE                               0x1
#define _RXF15EIDH_EID15_LENGTH                             0x1
#define _RXF15EIDH_EID15_MASK                               0x80
#define _RXF15EIDH_RXF15EID8_POSN                           0x0
#define _RXF15EIDH_RXF15EID8_POSITION                       0x0
#define _RXF15EIDH_RXF15EID8_SIZE                           0x1
#define _RXF15EIDH_RXF15EID8_LENGTH                         0x1
#define _RXF15EIDH_RXF15EID8_MASK                           0x1
#define _RXF15EIDH_RXF15EID9_POSN                           0x1
#define _RXF15EIDH_RXF15EID9_POSITION                       0x1
#define _RXF15EIDH_RXF15EID9_SIZE                           0x1
#define _RXF15EIDH_RXF15EID9_LENGTH                         0x1
#define _RXF15EIDH_RXF15EID9_MASK                           0x2
#define _RXF15EIDH_RXF15EID10_POSN                          0x2
#define _RXF15EIDH_RXF15EID10_POSITION                      0x2
#define _RXF15EIDH_RXF15EID10_SIZE                          0x1
#define _RXF15EIDH_RXF15EID10_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID10_MASK                          0x4
#define _RXF15EIDH_RXF15EID11_POSN                          0x3
#define _RXF15EIDH_RXF15EID11_POSITION                      0x3
#define _RXF15EIDH_RXF15EID11_SIZE                          0x1
#define _RXF15EIDH_RXF15EID11_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID11_MASK                          0x8
#define _RXF15EIDH_RXF15EID12_POSN                          0x4
#define _RXF15EIDH_RXF15EID12_POSITION                      0x4
#define _RXF15EIDH_RXF15EID12_SIZE                          0x1
#define _RXF15EIDH_RXF15EID12_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID12_MASK                          0x10
#define _RXF15EIDH_RXF15EID13_POSN                          0x5
#define _RXF15EIDH_RXF15EID13_POSITION                      0x5
#define _RXF15EIDH_RXF15EID13_SIZE                          0x1
#define _RXF15EIDH_RXF15EID13_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID13_MASK                          0x20
#define _RXF15EIDH_RXF15EID14_POSN                          0x6
#define _RXF15EIDH_RXF15EID14_POSITION                      0x6
#define _RXF15EIDH_RXF15EID14_SIZE                          0x1
#define _RXF15EIDH_RXF15EID14_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID14_MASK                          0x40
#define _RXF15EIDH_RXF15EID15_POSN                          0x7
#define _RXF15EIDH_RXF15EID15_POSITION                      0x7
#define _RXF15EIDH_RXF15EID15_SIZE                          0x1
#define _RXF15EIDH_RXF15EID15_LENGTH                        0x1
#define _RXF15EIDH_RXF15EID15_MASK                          0x80

// Register: RXF15EIDL
#define RXF15EIDL RXF15EIDL
extern volatile unsigned char           RXF15EIDL           __at(0xE6F);
#ifndef _LIB_BUILD
asm("RXF15EIDL equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF15EID0              :1;
        unsigned RXF15EID1              :1;
        unsigned RXF15EID2              :1;
        unsigned RXF15EID3              :1;
        unsigned RXF15EID4              :1;
        unsigned RXF15EID5              :1;
        unsigned RXF15EID6              :1;
        unsigned RXF15EID7              :1;
    };
} RXF15EIDLbits_t;
extern volatile RXF15EIDLbits_t RXF15EIDLbits __at(0xE6F);
// bitfield macros
#define _RXF15EIDL_EID_POSN                                 0x0
#define _RXF15EIDL_EID_POSITION                             0x0
#define _RXF15EIDL_EID_SIZE                                 0x8
#define _RXF15EIDL_EID_LENGTH                               0x8
#define _RXF15EIDL_EID_MASK                                 0xFF
#define _RXF15EIDL_EID0_POSN                                0x0
#define _RXF15EIDL_EID0_POSITION                            0x0
#define _RXF15EIDL_EID0_SIZE                                0x1
#define _RXF15EIDL_EID0_LENGTH                              0x1
#define _RXF15EIDL_EID0_MASK                                0x1
#define _RXF15EIDL_EID1_POSN                                0x1
#define _RXF15EIDL_EID1_POSITION                            0x1
#define _RXF15EIDL_EID1_SIZE                                0x1
#define _RXF15EIDL_EID1_LENGTH                              0x1
#define _RXF15EIDL_EID1_MASK                                0x2
#define _RXF15EIDL_EID2_POSN                                0x2
#define _RXF15EIDL_EID2_POSITION                            0x2
#define _RXF15EIDL_EID2_SIZE                                0x1
#define _RXF15EIDL_EID2_LENGTH                              0x1
#define _RXF15EIDL_EID2_MASK                                0x4
#define _RXF15EIDL_EID3_POSN                                0x3
#define _RXF15EIDL_EID3_POSITION                            0x3
#define _RXF15EIDL_EID3_SIZE                                0x1
#define _RXF15EIDL_EID3_LENGTH                              0x1
#define _RXF15EIDL_EID3_MASK                                0x8
#define _RXF15EIDL_EID4_POSN                                0x4
#define _RXF15EIDL_EID4_POSITION                            0x4
#define _RXF15EIDL_EID4_SIZE                                0x1
#define _RXF15EIDL_EID4_LENGTH                              0x1
#define _RXF15EIDL_EID4_MASK                                0x10
#define _RXF15EIDL_EID5_POSN                                0x5
#define _RXF15EIDL_EID5_POSITION                            0x5
#define _RXF15EIDL_EID5_SIZE                                0x1
#define _RXF15EIDL_EID5_LENGTH                              0x1
#define _RXF15EIDL_EID5_MASK                                0x20
#define _RXF15EIDL_EID6_POSN                                0x6
#define _RXF15EIDL_EID6_POSITION                            0x6
#define _RXF15EIDL_EID6_SIZE                                0x1
#define _RXF15EIDL_EID6_LENGTH                              0x1
#define _RXF15EIDL_EID6_MASK                                0x40
#define _RXF15EIDL_EID7_POSN                                0x7
#define _RXF15EIDL_EID7_POSITION                            0x7
#define _RXF15EIDL_EID7_SIZE                                0x1
#define _RXF15EIDL_EID7_LENGTH                              0x1
#define _RXF15EIDL_EID7_MASK                                0x80
#define _RXF15EIDL_RXF15EID0_POSN                           0x0
#define _RXF15EIDL_RXF15EID0_POSITION                       0x0
#define _RXF15EIDL_RXF15EID0_SIZE                           0x1
#define _RXF15EIDL_RXF15EID0_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID0_MASK                           0x1
#define _RXF15EIDL_RXF15EID1_POSN                           0x1
#define _RXF15EIDL_RXF15EID1_POSITION                       0x1
#define _RXF15EIDL_RXF15EID1_SIZE                           0x1
#define _RXF15EIDL_RXF15EID1_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID1_MASK                           0x2
#define _RXF15EIDL_RXF15EID2_POSN                           0x2
#define _RXF15EIDL_RXF15EID2_POSITION                       0x2
#define _RXF15EIDL_RXF15EID2_SIZE                           0x1
#define _RXF15EIDL_RXF15EID2_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID2_MASK                           0x4
#define _RXF15EIDL_RXF15EID3_POSN                           0x3
#define _RXF15EIDL_RXF15EID3_POSITION                       0x3
#define _RXF15EIDL_RXF15EID3_SIZE                           0x1
#define _RXF15EIDL_RXF15EID3_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID3_MASK                           0x8
#define _RXF15EIDL_RXF15EID4_POSN                           0x4
#define _RXF15EIDL_RXF15EID4_POSITION                       0x4
#define _RXF15EIDL_RXF15EID4_SIZE                           0x1
#define _RXF15EIDL_RXF15EID4_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID4_MASK                           0x10
#define _RXF15EIDL_RXF15EID5_POSN                           0x5
#define _RXF15EIDL_RXF15EID5_POSITION                       0x5
#define _RXF15EIDL_RXF15EID5_SIZE                           0x1
#define _RXF15EIDL_RXF15EID5_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID5_MASK                           0x20
#define _RXF15EIDL_RXF15EID6_POSN                           0x6
#define _RXF15EIDL_RXF15EID6_POSITION                       0x6
#define _RXF15EIDL_RXF15EID6_SIZE                           0x1
#define _RXF15EIDL_RXF15EID6_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID6_MASK                           0x40
#define _RXF15EIDL_RXF15EID7_POSN                           0x7
#define _RXF15EIDL_RXF15EID7_POSITION                       0x7
#define _RXF15EIDL_RXF15EID7_SIZE                           0x1
#define _RXF15EIDL_RXF15EID7_LENGTH                         0x1
#define _RXF15EIDL_RXF15EID7_MASK                           0x80

// Register: SDFLC
#define SDFLC SDFLC
extern volatile unsigned char           SDFLC               __at(0xE70);
#ifndef _LIB_BUILD
asm("SDFLC equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLC                    :5;
    };
    struct {
        unsigned FLC0                   :1;
        unsigned FLC1                   :1;
        unsigned FLC2                   :1;
        unsigned FLC3                   :1;
        unsigned FLC4                   :1;
    };
} SDFLCbits_t;
