MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
// Register: B4SIDL
#define B4SIDL B4SIDL
extern volatile unsigned char           B4SIDL              __at(0xEC2);
#ifndef _LIB_BUILD
asm("B4SIDL equ 0EC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned B4EID16                :1;
        unsigned B4EID17                :1;
        unsigned                        :1;
        unsigned B4EXID                 :1;
        unsigned B4SRR                  :1;
        unsigned B4SID0                 :1;
        unsigned B4SID1                 :1;
        unsigned B4SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B4EXIDE                :1;
    };
} B4SIDLbits_t;
extern volatile B4SIDLbits_t B4SIDLbits __at(0xEC2);
// bitfield macros
#define _B4SIDL_EID_POSN                                    0x0
#define _B4SIDL_EID_POSITION                                0x0
#define _B4SIDL_EID_SIZE                                    0x2
#define _B4SIDL_EID_LENGTH                                  0x2
#define _B4SIDL_EID_MASK                                    0x3
#define _B4SIDL_EXIDE_POSN                                  0x3
#define _B4SIDL_EXIDE_POSITION                              0x3
#define _B4SIDL_EXIDE_SIZE                                  0x1
#define _B4SIDL_EXIDE_LENGTH                                0x1
#define _B4SIDL_EXIDE_MASK                                  0x8
#define _B4SIDL_SRR_POSN                                    0x4
#define _B4SIDL_SRR_POSITION                                0x4
#define _B4SIDL_SRR_SIZE                                    0x1
#define _B4SIDL_SRR_LENGTH                                  0x1
#define _B4SIDL_SRR_MASK                                    0x10
#define _B4SIDL_SID_POSN                                    0x5
#define _B4SIDL_SID_POSITION                                0x5
#define _B4SIDL_SID_SIZE                                    0x3
#define _B4SIDL_SID_LENGTH                                  0x3
#define _B4SIDL_SID_MASK                                    0xE0
#define _B4SIDL_EID16_POSN                                  0x0
#define _B4SIDL_EID16_POSITION                              0x0
#define _B4SIDL_EID16_SIZE                                  0x1
#define _B4SIDL_EID16_LENGTH                                0x1
#define _B4SIDL_EID16_MASK                                  0x1
#define _B4SIDL_EID17_POSN                                  0x1
#define _B4SIDL_EID17_POSITION                              0x1
#define _B4SIDL_EID17_SIZE                                  0x1
#define _B4SIDL_EID17_LENGTH                                0x1
#define _B4SIDL_EID17_MASK                                  0x2
#define _B4SIDL_SID0_POSN                                   0x5
#define _B4SIDL_SID0_POSITION                               0x5
#define _B4SIDL_SID0_SIZE                                   0x1
#define _B4SIDL_SID0_LENGTH                                 0x1
#define _B4SIDL_SID0_MASK                                   0x20
#define _B4SIDL_SID1_POSN                                   0x6
#define _B4SIDL_SID1_POSITION                               0x6
#define _B4SIDL_SID1_SIZE                                   0x1
#define _B4SIDL_SID1_LENGTH                                 0x1
#define _B4SIDL_SID1_MASK                                   0x40
#define _B4SIDL_SID2_POSN                                   0x7
#define _B4SIDL_SID2_POSITION                               0x7
#define _B4SIDL_SID2_SIZE                                   0x1
#define _B4SIDL_SID2_LENGTH                                 0x1
#define _B4SIDL_SID2_MASK                                   0x80
#define _B4SIDL_B4EID16_POSN                                0x0
#define _B4SIDL_B4EID16_POSITION                            0x0
#define _B4SIDL_B4EID16_SIZE                                0x1
#define _B4SIDL_B4EID16_LENGTH                              0x1
#define _B4SIDL_B4EID16_MASK                                0x1
#define _B4SIDL_B4EID17_POSN                                0x1
#define _B4SIDL_B4EID17_POSITION                            0x1
#define _B4SIDL_B4EID17_SIZE                                0x1
#define _B4SIDL_B4EID17_LENGTH                              0x1
#define _B4SIDL_B4EID17_MASK                                0x2
#define _B4SIDL_B4EXID_POSN                                 0x3
#define _B4SIDL_B4EXID_POSITION                             0x3
#define _B4SIDL_B4EXID_SIZE                                 0x1
#define _B4SIDL_B4EXID_LENGTH                               0x1
#define _B4SIDL_B4EXID_MASK                                 0x8
#define _B4SIDL_B4SRR_POSN                                  0x4
#define _B4SIDL_B4SRR_POSITION                              0x4
#define _B4SIDL_B4SRR_SIZE                                  0x1
#define _B4SIDL_B4SRR_LENGTH                                0x1
#define _B4SIDL_B4SRR_MASK                                  0x10
#define _B4SIDL_B4SID0_POSN                                 0x5
#define _B4SIDL_B4SID0_POSITION                             0x5
#define _B4SIDL_B4SID0_SIZE                                 0x1
#define _B4SIDL_B4SID0_LENGTH                               0x1
#define _B4SIDL_B4SID0_MASK                                 0x20
#define _B4SIDL_B4SID1_POSN                                 0x6
#define _B4SIDL_B4SID1_POSITION                             0x6
#define _B4SIDL_B4SID1_SIZE                                 0x1
#define _B4SIDL_B4SID1_LENGTH                               0x1
#define _B4SIDL_B4SID1_MASK                                 0x40
#define _B4SIDL_B4SID2_POSN                                 0x7
#define _B4SIDL_B4SID2_POSITION                             0x7
#define _B4SIDL_B4SID2_SIZE                                 0x1
#define _B4SIDL_B4SID2_LENGTH                               0x1
#define _B4SIDL_B4SID2_MASK                                 0x80
#define _B4SIDL_B4EXIDE_POSN                                0x3
#define _B4SIDL_B4EXIDE_POSITION                            0x3
#define _B4SIDL_B4EXIDE_SIZE                                0x1
#define _B4SIDL_B4EXIDE_LENGTH                              0x1
#define _B4SIDL_B4EXIDE_MASK                                0x8

// Register: B4EIDH
#define B4EIDH B4EIDH
extern volatile unsigned char           B4EIDH              __at(0xEC3);
#ifndef _LIB_BUILD
asm("B4EIDH equ 0EC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B4EID8                 :1;
        unsigned B4EID9                 :1;
        unsigned B4EID10                :1;
        unsigned B4EID11                :1;
        unsigned B4EID12                :1;
        unsigned B4EID13                :1;
        unsigned B4EID14                :1;
        unsigned B4EID15                :1;
    };
} B4EIDHbits_t;
extern volatile B4EIDHbits_t B4EIDHbits __at(0xEC3);
// bitfield macros
#define _B4EIDH_EID_POSN                                    0x0
#define _B4EIDH_EID_POSITION                                0x0
#define _B4EIDH_EID_SIZE                                    0x8
#define _B4EIDH_EID_LENGTH                                  0x8
#define _B4EIDH_EID_MASK                                    0xFF
#define _B4EIDH_EID8_POSN                                   0x0
#define _B4EIDH_EID8_POSITION                               0x0
#define _B4EIDH_EID8_SIZE                                   0x1
#define _B4EIDH_EID8_LENGTH                                 0x1
#define _B4EIDH_EID8_MASK                                   0x1
#define _B4EIDH_EID9_POSN                                   0x1
#define _B4EIDH_EID9_POSITION                               0x1
#define _B4EIDH_EID9_SIZE                                   0x1
#define _B4EIDH_EID9_LENGTH                                 0x1
#define _B4EIDH_EID9_MASK                                   0x2
#define _B4EIDH_EID10_POSN                                  0x2
#define _B4EIDH_EID10_POSITION                              0x2
#define _B4EIDH_EID10_SIZE                                  0x1
#define _B4EIDH_EID10_LENGTH                                0x1
#define _B4EIDH_EID10_MASK                                  0x4
#define _B4EIDH_EID11_POSN                                  0x3
#define _B4EIDH_EID11_POSITION                              0x3
#define _B4EIDH_EID11_SIZE                                  0x1
#define _B4EIDH_EID11_LENGTH                                0x1
#define _B4EIDH_EID11_MASK                                  0x8
#define _B4EIDH_EID12_POSN                                  0x4
#define _B4EIDH_EID12_POSITION                              0x4
#define _B4EIDH_EID12_SIZE                                  0x1
#define _B4EIDH_EID12_LENGTH                                0x1
#define _B4EIDH_EID12_MASK                                  0x10
#define _B4EIDH_EID13_POSN                                  0x5
#define _B4EIDH_EID13_POSITION                              0x5
#define _B4EIDH_EID13_SIZE                                  0x1
#define _B4EIDH_EID13_LENGTH                                0x1
#define _B4EIDH_EID13_MASK                                  0x20
#define _B4EIDH_EID14_POSN                                  0x6
#define _B4EIDH_EID14_POSITION                              0x6
#define _B4EIDH_EID14_SIZE                                  0x1
#define _B4EIDH_EID14_LENGTH                                0x1
#define _B4EIDH_EID14_MASK                                  0x40
#define _B4EIDH_EID15_POSN                                  0x7
#define _B4EIDH_EID15_POSITION                              0x7
#define _B4EIDH_EID15_SIZE                                  0x1
#define _B4EIDH_EID15_LENGTH                                0x1
#define _B4EIDH_EID15_MASK                                  0x80
#define _B4EIDH_B4EID8_POSN                                 0x0
#define _B4EIDH_B4EID8_POSITION                             0x0
#define _B4EIDH_B4EID8_SIZE                                 0x1
#define _B4EIDH_B4EID8_LENGTH                               0x1
#define _B4EIDH_B4EID8_MASK                                 0x1
#define _B4EIDH_B4EID9_POSN                                 0x1
#define _B4EIDH_B4EID9_POSITION                             0x1
#define _B4EIDH_B4EID9_SIZE                                 0x1
#define _B4EIDH_B4EID9_LENGTH                               0x1
#define _B4EIDH_B4EID9_MASK                                 0x2
#define _B4EIDH_B4EID10_POSN                                0x2
#define _B4EIDH_B4EID10_POSITION                            0x2
#define _B4EIDH_B4EID10_SIZE                                0x1
#define _B4EIDH_B4EID10_LENGTH                              0x1
#define _B4EIDH_B4EID10_MASK                                0x4
#define _B4EIDH_B4EID11_POSN                                0x3
#define _B4EIDH_B4EID11_POSITION                            0x3
#define _B4EIDH_B4EID11_SIZE                                0x1
#define _B4EIDH_B4EID11_LENGTH                              0x1
#define _B4EIDH_B4EID11_MASK                                0x8
#define _B4EIDH_B4EID12_POSN                                0x4
#define _B4EIDH_B4EID12_POSITION                            0x4
#define _B4EIDH_B4EID12_SIZE                                0x1
#define _B4EIDH_B4EID12_LENGTH                              0x1
#define _B4EIDH_B4EID12_MASK                                0x10
#define _B4EIDH_B4EID13_POSN                                0x5
#define _B4EIDH_B4EID13_POSITION                            0x5
#define _B4EIDH_B4EID13_SIZE                                0x1
#define _B4EIDH_B4EID13_LENGTH                              0x1
#define _B4EIDH_B4EID13_MASK                                0x20
#define _B4EIDH_B4EID14_POSN                                0x6
#define _B4EIDH_B4EID14_POSITION                            0x6
#define _B4EIDH_B4EID14_SIZE                                0x1
#define _B4EIDH_B4EID14_LENGTH                              0x1
#define _B4EIDH_B4EID14_MASK                                0x40
#define _B4EIDH_B4EID15_POSN                                0x7
#define _B4EIDH_B4EID15_POSITION                            0x7
#define _B4EIDH_B4EID15_SIZE                                0x1
#define _B4EIDH_B4EID15_LENGTH                              0x1
#define _B4EIDH_B4EID15_MASK                                0x80

// Register: B4EIDL
#define B4EIDL B4EIDL
extern volatile unsigned char           B4EIDL              __at(0xEC4);
#ifndef _LIB_BUILD
asm("B4EIDL equ 0EC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B4EID0                 :1;
        unsigned B4EID1                 :1;
        unsigned B4EID2                 :1;
        unsigned B4EID3                 :1;
        unsigned B4EID4                 :1;
        unsigned B4EID5                 :1;
        unsigned B4EID6                 :1;
        unsigned B4EID7                 :1;
    };
} B4EIDLbits_t;
extern volatile B4EIDLbits_t B4EIDLbits __at(0xEC4);
// bitfield macros
#define _B4EIDL_EID_POSN                                    0x0
#define _B4EIDL_EID_POSITION                                0x0
#define _B4EIDL_EID_SIZE                                    0x8
#define _B4EIDL_EID_LENGTH                                  0x8
#define _B4EIDL_EID_MASK                                    0xFF
#define _B4EIDL_EID0_POSN                                   0x0
#define _B4EIDL_EID0_POSITION                               0x0
#define _B4EIDL_EID0_SIZE                                   0x1
#define _B4EIDL_EID0_LENGTH                                 0x1
#define _B4EIDL_EID0_MASK                                   0x1
#define _B4EIDL_EID1_POSN                                   0x1
#define _B4EIDL_EID1_POSITION                               0x1
#define _B4EIDL_EID1_SIZE                                   0x1
#define _B4EIDL_EID1_LENGTH                                 0x1
#define _B4EIDL_EID1_MASK                                   0x2
#define _B4EIDL_EID2_POSN                                   0x2
#define _B4EIDL_EID2_POSITION                               0x2
#define _B4EIDL_EID2_SIZE                                   0x1
#define _B4EIDL_EID2_LENGTH                                 0x1
#define _B4EIDL_EID2_MASK                                   0x4
#define _B4EIDL_EID3_POSN                                   0x3
#define _B4EIDL_EID3_POSITION                               0x3
#define _B4EIDL_EID3_SIZE                                   0x1
#define _B4EIDL_EID3_LENGTH                                 0x1
#define _B4EIDL_EID3_MASK                                   0x8
#define _B4EIDL_EID4_POSN                                   0x4
#define _B4EIDL_EID4_POSITION                               0x4
#define _B4EIDL_EID4_SIZE                                   0x1
#define _B4EIDL_EID4_LENGTH                                 0x1
#define _B4EIDL_EID4_MASK                                   0x10
#define _B4EIDL_EID5_POSN                                   0x5
#define _B4EIDL_EID5_POSITION                               0x5
#define _B4EIDL_EID5_SIZE                                   0x1
#define _B4EIDL_EID5_LENGTH                                 0x1
#define _B4EIDL_EID5_MASK                                   0x20
#define _B4EIDL_EID6_POSN                                   0x6
#define _B4EIDL_EID6_POSITION                               0x6
#define _B4EIDL_EID6_SIZE                                   0x1
#define _B4EIDL_EID6_LENGTH                                 0x1
#define _B4EIDL_EID6_MASK                                   0x40
#define _B4EIDL_EID7_POSN                                   0x7
#define _B4EIDL_EID7_POSITION                               0x7
#define _B4EIDL_EID7_SIZE                                   0x1
#define _B4EIDL_EID7_LENGTH                                 0x1
#define _B4EIDL_EID7_MASK                                   0x80
#define _B4EIDL_B4EID0_POSN                                 0x0
#define _B4EIDL_B4EID0_POSITION                             0x0
#define _B4EIDL_B4EID0_SIZE                                 0x1
#define _B4EIDL_B4EID0_LENGTH                               0x1
#define _B4EIDL_B4EID0_MASK                                 0x1
#define _B4EIDL_B4EID1_POSN                                 0x1
#define _B4EIDL_B4EID1_POSITION                             0x1
#define _B4EIDL_B4EID1_SIZE                                 0x1
#define _B4EIDL_B4EID1_LENGTH                               0x1
#define _B4EIDL_B4EID1_MASK                                 0x2
#define _B4EIDL_B4EID2_POSN                                 0x2
#define _B4EIDL_B4EID2_POSITION                             0x2
#define _B4EIDL_B4EID2_SIZE                                 0x1
#define _B4EIDL_B4EID2_LENGTH                               0x1
#define _B4EIDL_B4EID2_MASK                                 0x4
#define _B4EIDL_B4EID3_POSN                                 0x3
#define _B4EIDL_B4EID3_POSITION                             0x3
#define _B4EIDL_B4EID3_SIZE                                 0x1
#define _B4EIDL_B4EID3_LENGTH                               0x1
#define _B4EIDL_B4EID3_MASK                                 0x8
#define _B4EIDL_B4EID4_POSN                                 0x4
#define _B4EIDL_B4EID4_POSITION                             0x4
#define _B4EIDL_B4EID4_SIZE                                 0x1
#define _B4EIDL_B4EID4_LENGTH                               0x1
#define _B4EIDL_B4EID4_MASK                                 0x10
#define _B4EIDL_B4EID5_POSN                                 0x5
#define _B4EIDL_B4EID5_POSITION                             0x5
#define _B4EIDL_B4EID5_SIZE                                 0x1
#define _B4EIDL_B4EID5_LENGTH                               0x1
#define _B4EIDL_B4EID5_MASK                                 0x20
#define _B4EIDL_B4EID6_POSN                                 0x6
#define _B4EIDL_B4EID6_POSITION                             0x6
#define _B4EIDL_B4EID6_SIZE                                 0x1
#define _B4EIDL_B4EID6_LENGTH                               0x1
#define _B4EIDL_B4EID6_MASK                                 0x40
#define _B4EIDL_B4EID7_POSN                                 0x7
#define _B4EIDL_B4EID7_POSITION                             0x7
#define _B4EIDL_B4EID7_SIZE                                 0x1
#define _B4EIDL_B4EID7_LENGTH                               0x1
#define _B4EIDL_B4EID7_MASK                                 0x80

// Register: B4DLC
#define B4DLC B4DLC
extern volatile unsigned char           B4DLC               __at(0xEC5);
#ifndef _LIB_BUILD
asm("B4DLC equ 0EC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned RB                     :2;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B4DLC0                 :1;
        unsigned B4DLC1                 :1;
        unsigned B4DLC2                 :1;
        unsigned B4DLC3                 :1;
        unsigned B4RB0                  :1;
        unsigned B4RB1                  :1;
        unsigned B4RXRTR                :1;
    };
} B4DLCbits_t;
