MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
// Register: RXF5SIDH
#define RXF5SIDH RXF5SIDH
extern volatile unsigned char           RXF5SIDH            __at(0xEF4);
#ifndef _LIB_BUILD
asm("RXF5SIDH equ 0EF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF5SID3               :1;
        unsigned RXF5SID4               :1;
        unsigned RXF5SID5               :1;
        unsigned RXF5SID6               :1;
        unsigned RXF5SID7               :1;
        unsigned RXF5SID8               :1;
        unsigned RXF5SID9               :1;
        unsigned RXF5SID10              :1;
    };
} RXF5SIDHbits_t;
extern volatile RXF5SIDHbits_t RXF5SIDHbits __at(0xEF4);
// bitfield macros
#define _RXF5SIDH_SID_POSN                                  0x0
#define _RXF5SIDH_SID_POSITION                              0x0
#define _RXF5SIDH_SID_SIZE                                  0x8
#define _RXF5SIDH_SID_LENGTH                                0x8
#define _RXF5SIDH_SID_MASK                                  0xFF
#define _RXF5SIDH_SID3_POSN                                 0x0
#define _RXF5SIDH_SID3_POSITION                             0x0
#define _RXF5SIDH_SID3_SIZE                                 0x1
#define _RXF5SIDH_SID3_LENGTH                               0x1
#define _RXF5SIDH_SID3_MASK                                 0x1
#define _RXF5SIDH_SID4_POSN                                 0x1
#define _RXF5SIDH_SID4_POSITION                             0x1
#define _RXF5SIDH_SID4_SIZE                                 0x1
#define _RXF5SIDH_SID4_LENGTH                               0x1
#define _RXF5SIDH_SID4_MASK                                 0x2
#define _RXF5SIDH_SID5_POSN                                 0x2
#define _RXF5SIDH_SID5_POSITION                             0x2
#define _RXF5SIDH_SID5_SIZE                                 0x1
#define _RXF5SIDH_SID5_LENGTH                               0x1
#define _RXF5SIDH_SID5_MASK                                 0x4
#define _RXF5SIDH_SID6_POSN                                 0x3
#define _RXF5SIDH_SID6_POSITION                             0x3
#define _RXF5SIDH_SID6_SIZE                                 0x1
#define _RXF5SIDH_SID6_LENGTH                               0x1
#define _RXF5SIDH_SID6_MASK                                 0x8
#define _RXF5SIDH_SID7_POSN                                 0x4
#define _RXF5SIDH_SID7_POSITION                             0x4
#define _RXF5SIDH_SID7_SIZE                                 0x1
#define _RXF5SIDH_SID7_LENGTH                               0x1
#define _RXF5SIDH_SID7_MASK                                 0x10
#define _RXF5SIDH_SID8_POSN                                 0x5
#define _RXF5SIDH_SID8_POSITION                             0x5
#define _RXF5SIDH_SID8_SIZE                                 0x1
#define _RXF5SIDH_SID8_LENGTH                               0x1
#define _RXF5SIDH_SID8_MASK                                 0x20
#define _RXF5SIDH_SID9_POSN                                 0x6
#define _RXF5SIDH_SID9_POSITION                             0x6
#define _RXF5SIDH_SID9_SIZE                                 0x1
#define _RXF5SIDH_SID9_LENGTH                               0x1
#define _RXF5SIDH_SID9_MASK                                 0x40
#define _RXF5SIDH_SID10_POSN                                0x7
#define _RXF5SIDH_SID10_POSITION                            0x7
#define _RXF5SIDH_SID10_SIZE                                0x1
#define _RXF5SIDH_SID10_LENGTH                              0x1
#define _RXF5SIDH_SID10_MASK                                0x80
#define _RXF5SIDH_RXF5SID3_POSN                             0x0
#define _RXF5SIDH_RXF5SID3_POSITION                         0x0
#define _RXF5SIDH_RXF5SID3_SIZE                             0x1
#define _RXF5SIDH_RXF5SID3_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID3_MASK                             0x1
#define _RXF5SIDH_RXF5SID4_POSN                             0x1
#define _RXF5SIDH_RXF5SID4_POSITION                         0x1
#define _RXF5SIDH_RXF5SID4_SIZE                             0x1
#define _RXF5SIDH_RXF5SID4_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID4_MASK                             0x2
#define _RXF5SIDH_RXF5SID5_POSN                             0x2
#define _RXF5SIDH_RXF5SID5_POSITION                         0x2
#define _RXF5SIDH_RXF5SID5_SIZE                             0x1
#define _RXF5SIDH_RXF5SID5_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID5_MASK                             0x4
#define _RXF5SIDH_RXF5SID6_POSN                             0x3
#define _RXF5SIDH_RXF5SID6_POSITION                         0x3
#define _RXF5SIDH_RXF5SID6_SIZE                             0x1
#define _RXF5SIDH_RXF5SID6_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID6_MASK                             0x8
#define _RXF5SIDH_RXF5SID7_POSN                             0x4
#define _RXF5SIDH_RXF5SID7_POSITION                         0x4
#define _RXF5SIDH_RXF5SID7_SIZE                             0x1
#define _RXF5SIDH_RXF5SID7_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID7_MASK                             0x10
#define _RXF5SIDH_RXF5SID8_POSN                             0x5
#define _RXF5SIDH_RXF5SID8_POSITION                         0x5
#define _RXF5SIDH_RXF5SID8_SIZE                             0x1
#define _RXF5SIDH_RXF5SID8_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID8_MASK                             0x20
#define _RXF5SIDH_RXF5SID9_POSN                             0x6
#define _RXF5SIDH_RXF5SID9_POSITION                         0x6
#define _RXF5SIDH_RXF5SID9_SIZE                             0x1
#define _RXF5SIDH_RXF5SID9_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID9_MASK                             0x40
#define _RXF5SIDH_RXF5SID10_POSN                            0x7
#define _RXF5SIDH_RXF5SID10_POSITION                        0x7
#define _RXF5SIDH_RXF5SID10_SIZE                            0x1
#define _RXF5SIDH_RXF5SID10_LENGTH                          0x1
#define _RXF5SIDH_RXF5SID10_MASK                            0x80

// Register: RXF5SIDL
#define RXF5SIDL RXF5SIDL
extern volatile unsigned char           RXF5SIDL            __at(0xEF5);
#ifndef _LIB_BUILD
asm("RXF5SIDL equ 0EF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF5EID16              :1;
        unsigned RXF5EID17              :1;
        unsigned                        :1;
        unsigned RXF5EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF5SID0               :1;
        unsigned RXF5SID1               :1;
        unsigned RXF5SID2               :1;
    };
} RXF5SIDLbits_t;
extern volatile RXF5SIDLbits_t RXF5SIDLbits __at(0xEF5);
// bitfield macros
#define _RXF5SIDL_EID_POSN                                  0x0
#define _RXF5SIDL_EID_POSITION                              0x0
#define _RXF5SIDL_EID_SIZE                                  0x2
#define _RXF5SIDL_EID_LENGTH                                0x2
#define _RXF5SIDL_EID_MASK                                  0x3
#define _RXF5SIDL_EXIDEN_POSN                               0x3
#define _RXF5SIDL_EXIDEN_POSITION                           0x3
#define _RXF5SIDL_EXIDEN_SIZE                               0x1
#define _RXF5SIDL_EXIDEN_LENGTH                             0x1
#define _RXF5SIDL_EXIDEN_MASK                               0x8
#define _RXF5SIDL_SID_POSN                                  0x5
#define _RXF5SIDL_SID_POSITION                              0x5
#define _RXF5SIDL_SID_SIZE                                  0x3
#define _RXF5SIDL_SID_LENGTH                                0x3
#define _RXF5SIDL_SID_MASK                                  0xE0
#define _RXF5SIDL_EID16_POSN                                0x0
#define _RXF5SIDL_EID16_POSITION                            0x0
#define _RXF5SIDL_EID16_SIZE                                0x1
#define _RXF5SIDL_EID16_LENGTH                              0x1
#define _RXF5SIDL_EID16_MASK                                0x1
#define _RXF5SIDL_EID17_POSN                                0x1
#define _RXF5SIDL_EID17_POSITION                            0x1
#define _RXF5SIDL_EID17_SIZE                                0x1
#define _RXF5SIDL_EID17_LENGTH                              0x1
#define _RXF5SIDL_EID17_MASK                                0x2
#define _RXF5SIDL_SID0_POSN                                 0x5
#define _RXF5SIDL_SID0_POSITION                             0x5
#define _RXF5SIDL_SID0_SIZE                                 0x1
#define _RXF5SIDL_SID0_LENGTH                               0x1
#define _RXF5SIDL_SID0_MASK                                 0x20
#define _RXF5SIDL_SID1_POSN                                 0x6
#define _RXF5SIDL_SID1_POSITION                             0x6
#define _RXF5SIDL_SID1_SIZE                                 0x1
#define _RXF5SIDL_SID1_LENGTH                               0x1
#define _RXF5SIDL_SID1_MASK                                 0x40
#define _RXF5SIDL_SID2_POSN                                 0x7
#define _RXF5SIDL_SID2_POSITION                             0x7
#define _RXF5SIDL_SID2_SIZE                                 0x1
#define _RXF5SIDL_SID2_LENGTH                               0x1
#define _RXF5SIDL_SID2_MASK                                 0x80
#define _RXF5SIDL_RXF5EID16_POSN                            0x0
#define _RXF5SIDL_RXF5EID16_POSITION                        0x0
#define _RXF5SIDL_RXF5EID16_SIZE                            0x1
#define _RXF5SIDL_RXF5EID16_LENGTH                          0x1
#define _RXF5SIDL_RXF5EID16_MASK                            0x1
#define _RXF5SIDL_RXF5EID17_POSN                            0x1
#define _RXF5SIDL_RXF5EID17_POSITION                        0x1
#define _RXF5SIDL_RXF5EID17_SIZE                            0x1
#define _RXF5SIDL_RXF5EID17_LENGTH                          0x1
#define _RXF5SIDL_RXF5EID17_MASK                            0x2
#define _RXF5SIDL_RXF5EXIDEN_POSN                           0x3
#define _RXF5SIDL_RXF5EXIDEN_POSITION                       0x3
#define _RXF5SIDL_RXF5EXIDEN_SIZE                           0x1
#define _RXF5SIDL_RXF5EXIDEN_LENGTH                         0x1
#define _RXF5SIDL_RXF5EXIDEN_MASK                           0x8
#define _RXF5SIDL_RXF5SID0_POSN                             0x5
#define _RXF5SIDL_RXF5SID0_POSITION                         0x5
#define _RXF5SIDL_RXF5SID0_SIZE                             0x1
#define _RXF5SIDL_RXF5SID0_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID0_MASK                             0x20
#define _RXF5SIDL_RXF5SID1_POSN                             0x6
#define _RXF5SIDL_RXF5SID1_POSITION                         0x6
#define _RXF5SIDL_RXF5SID1_SIZE                             0x1
#define _RXF5SIDL_RXF5SID1_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID1_MASK                             0x40
#define _RXF5SIDL_RXF5SID2_POSN                             0x7
#define _RXF5SIDL_RXF5SID2_POSITION                         0x7
#define _RXF5SIDL_RXF5SID2_SIZE                             0x1
#define _RXF5SIDL_RXF5SID2_LENGTH                           0x1
#define _RXF5SIDL_RXF5SID2_MASK                             0x80

// Register: RXF5EIDH
#define RXF5EIDH RXF5EIDH
extern volatile unsigned char           RXF5EIDH            __at(0xEF6);
#ifndef _LIB_BUILD
asm("RXF5EIDH equ 0EF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF5EID8               :1;
        unsigned RXF5EID9               :1;
        unsigned RXF5EID10              :1;
        unsigned RXF5EID11              :1;
        unsigned RXF5EID12              :1;
        unsigned RXF5EID13              :1;
        unsigned RXF5EID14              :1;
        unsigned RXF5EID15              :1;
    };
} RXF5EIDHbits_t;
