MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
// Register: CTMUCONH
#define CTMUCONH CTMUCONH
extern volatile unsigned char           CTMUCONH            __at(0xF55);
#ifndef _LIB_BUILD
asm("CTMUCONH equ 0F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTTRIG                 :1;
        unsigned IDISSEN                :1;
        unsigned EDGSEQEN               :1;
        unsigned EDGEN                  :1;
        unsigned TGEN                   :1;
        unsigned CTMUSIDL               :1;
        unsigned                        :1;
        unsigned CTMUEN                 :1;
    };
} CTMUCONHbits_t;
extern volatile CTMUCONHbits_t CTMUCONHbits __at(0xF55);
// bitfield macros
#define _CTMUCONH_CTTRIG_POSN                               0x0
#define _CTMUCONH_CTTRIG_POSITION                           0x0
#define _CTMUCONH_CTTRIG_SIZE                               0x1
#define _CTMUCONH_CTTRIG_LENGTH                             0x1
#define _CTMUCONH_CTTRIG_MASK                               0x1
#define _CTMUCONH_IDISSEN_POSN                              0x1
#define _CTMUCONH_IDISSEN_POSITION                          0x1
#define _CTMUCONH_IDISSEN_SIZE                              0x1
#define _CTMUCONH_IDISSEN_LENGTH                            0x1
#define _CTMUCONH_IDISSEN_MASK                              0x2
#define _CTMUCONH_EDGSEQEN_POSN                             0x2
#define _CTMUCONH_EDGSEQEN_POSITION                         0x2
#define _CTMUCONH_EDGSEQEN_SIZE                             0x1
#define _CTMUCONH_EDGSEQEN_LENGTH                           0x1
#define _CTMUCONH_EDGSEQEN_MASK                             0x4
#define _CTMUCONH_EDGEN_POSN                                0x3
#define _CTMUCONH_EDGEN_POSITION                            0x3
#define _CTMUCONH_EDGEN_SIZE                                0x1
#define _CTMUCONH_EDGEN_LENGTH                              0x1
#define _CTMUCONH_EDGEN_MASK                                0x8
#define _CTMUCONH_TGEN_POSN                                 0x4
#define _CTMUCONH_TGEN_POSITION                             0x4
#define _CTMUCONH_TGEN_SIZE                                 0x1
#define _CTMUCONH_TGEN_LENGTH                               0x1
#define _CTMUCONH_TGEN_MASK                                 0x10
#define _CTMUCONH_CTMUSIDL_POSN                             0x5
#define _CTMUCONH_CTMUSIDL_POSITION                         0x5
#define _CTMUCONH_CTMUSIDL_SIZE                             0x1
#define _CTMUCONH_CTMUSIDL_LENGTH                           0x1
#define _CTMUCONH_CTMUSIDL_MASK                             0x20
#define _CTMUCONH_CTMUEN_POSN                               0x7
#define _CTMUCONH_CTMUEN_POSITION                           0x7
#define _CTMUCONH_CTMUEN_SIZE                               0x1
#define _CTMUCONH_CTMUEN_LENGTH                             0x1
#define _CTMUCONH_CTMUEN_MASK                               0x80

// Register: PADCFG1
#define PADCFG1 PADCFG1
extern volatile unsigned char           PADCFG1             __at(0xF56);
#ifndef _LIB_BUILD
asm("PADCFG1 equ 0F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUDS                 :1;
    };
    struct {
        unsigned PMPTTL                 :1;
    };
} PADCFG1bits_t;
extern volatile PADCFG1bits_t PADCFG1bits __at(0xF56);
// bitfield macros
#define _PADCFG1_CTMUDS_POSN                                0x0
#define _PADCFG1_CTMUDS_POSITION                            0x0
#define _PADCFG1_CTMUDS_SIZE                                0x1
#define _PADCFG1_CTMUDS_LENGTH                              0x1
#define _PADCFG1_CTMUDS_MASK                                0x1
#define _PADCFG1_PMPTTL_POSN                                0x0
#define _PADCFG1_PMPTTL_POSITION                            0x0
#define _PADCFG1_PMPTTL_SIZE                                0x1
#define _PADCFG1_PMPTTL_LENGTH                              0x1
#define _PADCFG1_PMPTTL_MASK                                0x1

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xF57);
#ifndef _LIB_BUILD
asm("PMD2 equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned ECANMD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xF57);
// bitfield macros
#define _PMD2_CMP1MD_POSN                                   0x0
#define _PMD2_CMP1MD_POSITION                               0x0
#define _PMD2_CMP1MD_SIZE                                   0x1
#define _PMD2_CMP1MD_LENGTH                                 0x1
#define _PMD2_CMP1MD_MASK                                   0x1
#define _PMD2_CMP2MD_POSN                                   0x1
#define _PMD2_CMP2MD_POSITION                               0x1
#define _PMD2_CMP2MD_SIZE                                   0x1
#define _PMD2_CMP2MD_LENGTH                                 0x1
#define _PMD2_CMP2MD_MASK                                   0x2
#define _PMD2_ECANMD_POSN                                   0x2
#define _PMD2_ECANMD_POSITION                               0x2
#define _PMD2_ECANMD_SIZE                                   0x1
#define _PMD2_ECANMD_LENGTH                                 0x1
#define _PMD2_ECANMD_MASK                                   0x4

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xF58);
#ifndef _LIB_BUILD
asm("PMD1 equ 0F58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned ADCMD                  :1;
        unsigned CTMUMD                 :1;
        unsigned PSPMD                  :1;
    };
    struct {
        unsigned EMBMD                  :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0xF58);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_ADCMD_POSN                                    0x5
#define _PMD1_ADCMD_POSITION                                0x5
#define _PMD1_ADCMD_SIZE                                    0x1
#define _PMD1_ADCMD_LENGTH                                  0x1
#define _PMD1_ADCMD_MASK                                    0x20
#define _PMD1_CTMUMD_POSN                                   0x6
#define _PMD1_CTMUMD_POSITION                               0x6
#define _PMD1_CTMUMD_SIZE                                   0x1
#define _PMD1_CTMUMD_LENGTH                                 0x1
#define _PMD1_CTMUMD_MASK                                   0x40
#define _PMD1_PSPMD_POSN                                    0x7
#define _PMD1_PSPMD_POSITION                                0x7
#define _PMD1_PSPMD_SIZE                                    0x1
#define _PMD1_PSPMD_LENGTH                                  0x1
#define _PMD1_PSPMD_MASK                                    0x80
#define _PMD1_EMBMD_POSN                                    0x0
#define _PMD1_EMBMD_POSITION                                0x0
#define _PMD1_EMBMD_SIZE                                    0x1
#define _PMD1_EMBMD_LENGTH                                  0x1
#define _PMD1_EMBMD_MASK                                    0x1

