MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
extern volatile WPUBbits_t WPUBbits __at(0xF5B);
// bitfield macros
#define _WPUB_WPUB0_POSN                                    0x0
#define _WPUB_WPUB0_POSITION                                0x0
#define _WPUB_WPUB0_SIZE                                    0x1
#define _WPUB_WPUB0_LENGTH                                  0x1
#define _WPUB_WPUB0_MASK                                    0x1
#define _WPUB_WPUB1_POSN                                    0x1
#define _WPUB_WPUB1_POSITION                                0x1
#define _WPUB_WPUB1_SIZE                                    0x1
#define _WPUB_WPUB1_LENGTH                                  0x1
#define _WPUB_WPUB1_MASK                                    0x2
#define _WPUB_WPUB2_POSN                                    0x2
#define _WPUB_WPUB2_POSITION                                0x2
#define _WPUB_WPUB2_SIZE                                    0x1
#define _WPUB_WPUB2_LENGTH                                  0x1
#define _WPUB_WPUB2_MASK                                    0x4
#define _WPUB_WPUB3_POSN                                    0x3
#define _WPUB_WPUB3_POSITION                                0x3
#define _WPUB_WPUB3_SIZE                                    0x1
#define _WPUB_WPUB3_LENGTH                                  0x1
#define _WPUB_WPUB3_MASK                                    0x8
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xF5C);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0F5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
    };
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
    };
} ANCON1bits_t;
extern volatile ANCON1bits_t ANCON1bits __at(0xF5C);
// bitfield macros
#define _ANCON1_ANSEL8_POSN                                 0x0
#define _ANCON1_ANSEL8_POSITION                             0x0
#define _ANCON1_ANSEL8_SIZE                                 0x1
#define _ANCON1_ANSEL8_LENGTH                               0x1
#define _ANCON1_ANSEL8_MASK                                 0x1
#define _ANCON1_ANSEL9_POSN                                 0x1
#define _ANCON1_ANSEL9_POSITION                             0x1
#define _ANCON1_ANSEL9_SIZE                                 0x1
#define _ANCON1_ANSEL9_LENGTH                               0x1
#define _ANCON1_ANSEL9_MASK                                 0x2
#define _ANCON1_ANSEL10_POSN                                0x2
#define _ANCON1_ANSEL10_POSITION                            0x2
#define _ANCON1_ANSEL10_SIZE                                0x1
#define _ANCON1_ANSEL10_LENGTH                              0x1
#define _ANCON1_ANSEL10_MASK                                0x4
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4

// Register: ANCON0
#define ANCON0 ANCON0
extern volatile unsigned char           ANCON0              __at(0xF5D);
#ifndef _LIB_BUILD
asm("ANCON0 equ 0F5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL0                 :1;
        unsigned ANSEL1                 :1;
        unsigned ANSEL2                 :1;
        unsigned ANSEL3                 :1;
        unsigned ANSEL4                 :1;
    };
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
        unsigned PCFG3                  :1;
        unsigned PCFG4                  :1;
    };
} ANCON0bits_t;
extern volatile ANCON0bits_t ANCON0bits __at(0xF5D);
// bitfield macros
#define _ANCON0_ANSEL0_POSN                                 0x0
#define _ANCON0_ANSEL0_POSITION                             0x0
#define _ANCON0_ANSEL0_SIZE                                 0x1
#define _ANCON0_ANSEL0_LENGTH                               0x1
#define _ANCON0_ANSEL0_MASK                                 0x1
#define _ANCON0_ANSEL1_POSN                                 0x1
#define _ANCON0_ANSEL1_POSITION                             0x1
#define _ANCON0_ANSEL1_SIZE                                 0x1
#define _ANCON0_ANSEL1_LENGTH                               0x1
#define _ANCON0_ANSEL1_MASK                                 0x2
#define _ANCON0_ANSEL2_POSN                                 0x2
#define _ANCON0_ANSEL2_POSITION                             0x2
#define _ANCON0_ANSEL2_SIZE                                 0x1
#define _ANCON0_ANSEL2_LENGTH                               0x1
#define _ANCON0_ANSEL2_MASK                                 0x4
#define _ANCON0_ANSEL3_POSN                                 0x3
#define _ANCON0_ANSEL3_POSITION                             0x3
#define _ANCON0_ANSEL3_SIZE                                 0x1
#define _ANCON0_ANSEL3_LENGTH                               0x1
#define _ANCON0_ANSEL3_MASK                                 0x8
#define _ANCON0_ANSEL4_POSN                                 0x4
#define _ANCON0_ANSEL4_POSITION                             0x4
#define _ANCON0_ANSEL4_SIZE                                 0x1
#define _ANCON0_ANSEL4_LENGTH                               0x1
#define _ANCON0_ANSEL4_MASK                                 0x10
#define _ANCON0_PCFG0_POSN                                  0x0
#define _ANCON0_PCFG0_POSITION                              0x0
#define _ANCON0_PCFG0_SIZE                                  0x1
#define _ANCON0_PCFG0_LENGTH                                0x1
#define _ANCON0_PCFG0_MASK                                  0x1
#define _ANCON0_PCFG1_POSN                                  0x1
#define _ANCON0_PCFG1_POSITION                              0x1
#define _ANCON0_PCFG1_SIZE                                  0x1
#define _ANCON0_PCFG1_LENGTH                                0x1
#define _ANCON0_PCFG1_MASK                                  0x2
#define _ANCON0_PCFG2_POSN                                  0x2
#define _ANCON0_PCFG2_POSITION                              0x2
#define _ANCON0_PCFG2_SIZE                                  0x1
#define _ANCON0_PCFG2_LENGTH                                0x1
#define _ANCON0_PCFG2_MASK                                  0x4
#define _ANCON0_PCFG3_POSN                                  0x3
#define _ANCON0_PCFG3_POSITION                              0x3
#define _ANCON0_PCFG3_SIZE                                  0x1
#define _ANCON0_PCFG3_LENGTH                                0x1
#define _ANCON0_PCFG3_MASK                                  0x8
#define _ANCON0_PCFG4_POSN                                  0x4
#define _ANCON0_PCFG4_POSITION                              0x4
#define _ANCON0_PCFG4_SIZE                                  0x1
#define _ANCON0_PCFG4_LENGTH                                0x1
#define _ANCON0_PCFG4_MASK                                  0x10

