MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
#define                                 RXB0SID0_bit        _BIT_ACCESS(RXB0SIDL,5)
// RXB0SIDL<RXB0SID1>
extern volatile __bit                   RXB0SID1            __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 RXB0SID1_bit        _BIT_ACCESS(RXB0SIDL,6)
// RXB0SIDH<RXB0SID10>
extern volatile __bit                   RXB0SID10           __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 RXB0SID10_bit       _BIT_ACCESS(RXB0SIDH,7)
// RXB0SIDL<RXB0SID2>
extern volatile __bit                   RXB0SID2            __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 RXB0SID2_bit        _BIT_ACCESS(RXB0SIDL,7)
// RXB0SIDH<RXB0SID3>
extern volatile __bit                   RXB0SID3            __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 RXB0SID3_bit        _BIT_ACCESS(RXB0SIDH,0)
// RXB0SIDH<RXB0SID4>
extern volatile __bit                   RXB0SID4            __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 RXB0SID4_bit        _BIT_ACCESS(RXB0SIDH,1)
// RXB0SIDH<RXB0SID5>
extern volatile __bit                   RXB0SID5            __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 RXB0SID5_bit        _BIT_ACCESS(RXB0SIDH,2)
// RXB0SIDH<RXB0SID6>
extern volatile __bit                   RXB0SID6            __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 RXB0SID6_bit        _BIT_ACCESS(RXB0SIDH,3)
// RXB0SIDH<RXB0SID7>
extern volatile __bit                   RXB0SID7            __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 RXB0SID7_bit        _BIT_ACCESS(RXB0SIDH,4)
// RXB0SIDH<RXB0SID8>
extern volatile __bit                   RXB0SID8            __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 RXB0SID8_bit        _BIT_ACCESS(RXB0SIDH,5)
// RXB0SIDH<RXB0SID9>
extern volatile __bit                   RXB0SID9            __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 RXB0SID9_bit        _BIT_ACCESS(RXB0SIDH,6)
// RXB0SIDL<RXB0SRR>
extern volatile __bit                   RXB0SRR             __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 RXB0SRR_bit         _BIT_ACCESS(RXB0SIDL,4)
// RXB1D0<RXB1D00>
extern volatile __bit                   RXB1D00             __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 RXB1D00_bit         _BIT_ACCESS(RXB1D0,0)
// RXB1D0<RXB1D01>
extern volatile __bit                   RXB1D01             __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 RXB1D01_bit         _BIT_ACCESS(RXB1D0,1)
// RXB1D0<RXB1D02>
extern volatile __bit                   RXB1D02             __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 RXB1D02_bit         _BIT_ACCESS(RXB1D0,2)
// RXB1D0<RXB1D03>
extern volatile __bit                   RXB1D03             __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 RXB1D03_bit         _BIT_ACCESS(RXB1D0,3)
// RXB1D0<RXB1D04>
extern volatile __bit                   RXB1D04             __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 RXB1D04_bit         _BIT_ACCESS(RXB1D0,4)
// RXB1D0<RXB1D05>
extern volatile __bit                   RXB1D05             __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 RXB1D05_bit         _BIT_ACCESS(RXB1D0,5)
// RXB1D0<RXB1D06>
extern volatile __bit                   RXB1D06             __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 RXB1D06_bit         _BIT_ACCESS(RXB1D0,6)
// RXB1D0<RXB1D07>
extern volatile __bit                   RXB1D07             __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 RXB1D07_bit         _BIT_ACCESS(RXB1D0,7)
// RXB1D1<RXB1D10>
extern volatile __bit                   RXB1D10             __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 RXB1D10_bit         _BIT_ACCESS(RXB1D1,0)
// RXB1D1<RXB1D11>
extern volatile __bit                   RXB1D11             __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 RXB1D11_bit         _BIT_ACCESS(RXB1D1,1)
// RXB1D1<RXB1D12>
extern volatile __bit                   RXB1D12             __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 RXB1D12_bit         _BIT_ACCESS(RXB1D1,2)
// RXB1D1<RXB1D13>
extern volatile __bit                   RXB1D13             __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 RXB1D13_bit         _BIT_ACCESS(RXB1D1,3)
// RXB1D1<RXB1D14>
extern volatile __bit                   RXB1D14             __at(0x79BC);	// @ (0xF37 * 8 + 4)
#define                                 RXB1D14_bit         _BIT_ACCESS(RXB1D1,4)
// RXB1D1<RXB1D15>
extern volatile __bit                   RXB1D15             __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 RXB1D15_bit         _BIT_ACCESS(RXB1D1,5)
// RXB1D1<RXB1D16>
extern volatile __bit                   RXB1D16             __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 RXB1D16_bit         _BIT_ACCESS(RXB1D1,6)
// RXB1D1<RXB1D17>
extern volatile __bit                   RXB1D17             __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 RXB1D17_bit         _BIT_ACCESS(RXB1D1,7)
// RXB1D2<RXB1D20>
extern volatile __bit                   RXB1D20             __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 RXB1D20_bit         _BIT_ACCESS(RXB1D2,0)
// RXB1D2<RXB1D21>
extern volatile __bit                   RXB1D21             __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 RXB1D21_bit         _BIT_ACCESS(RXB1D2,1)
// RXB1D2<RXB1D22>
extern volatile __bit                   RXB1D22             __at(0x79C2);	// @ (0xF38 * 8 + 2)
#define                                 RXB1D22_bit         _BIT_ACCESS(RXB1D2,2)
// RXB1D2<RXB1D23>
extern volatile __bit                   RXB1D23             __at(0x79C3);	// @ (0xF38 * 8 + 3)
#define                                 RXB1D23_bit         _BIT_ACCESS(RXB1D2,3)
// RXB1D2<RXB1D24>
extern volatile __bit                   RXB1D24             __at(0x79C4);	// @ (0xF38 * 8 + 4)
#define                                 RXB1D24_bit         _BIT_ACCESS(RXB1D2,4)
// RXB1D2<RXB1D25>
extern volatile __bit                   RXB1D25             __at(0x79C5);	// @ (0xF38 * 8 + 5)
#define                                 RXB1D25_bit         _BIT_ACCESS(RXB1D2,5)
// RXB1D2<RXB1D26>
extern volatile __bit                   RXB1D26             __at(0x79C6);	// @ (0xF38 * 8 + 6)
#define                                 RXB1D26_bit         _BIT_ACCESS(RXB1D2,6)
// RXB1D2<RXB1D27>
extern volatile __bit                   RXB1D27             __at(0x79C7);	// @ (0xF38 * 8 + 7)
#define                                 RXB1D27_bit         _BIT_ACCESS(RXB1D2,7)
// RXB1D3<RXB1D30>
extern volatile __bit                   RXB1D30             __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 RXB1D30_bit         _BIT_ACCESS(RXB1D3,0)
// RXB1D3<RXB1D31>
extern volatile __bit                   RXB1D31             __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 RXB1D31_bit         _BIT_ACCESS(RXB1D3,1)
// RXB1D3<RXB1D32>
extern volatile __bit                   RXB1D32             __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 RXB1D32_bit         _BIT_ACCESS(RXB1D3,2)
// RXB1D3<RXB1D33>
extern volatile __bit                   RXB1D33             __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 RXB1D33_bit         _BIT_ACCESS(RXB1D3,3)
// RXB1D3<RXB1D34>
extern volatile __bit                   RXB1D34             __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 RXB1D34_bit         _BIT_ACCESS(RXB1D3,4)
// RXB1D3<RXB1D35>
extern volatile __bit                   RXB1D35             __at(0x79CD);	// @ (0xF39 * 8 + 5)
#define                                 RXB1D35_bit         _BIT_ACCESS(RXB1D3,5)
// RXB1D3<RXB1D36>
extern volatile __bit                   RXB1D36             __at(0x79CE);	// @ (0xF39 * 8 + 6)
#define                                 RXB1D36_bit         _BIT_ACCESS(RXB1D3,6)
// RXB1D3<RXB1D37>
extern volatile __bit                   RXB1D37             __at(0x79CF);	// @ (0xF39 * 8 + 7)
#define                                 RXB1D37_bit         _BIT_ACCESS(RXB1D3,7)
// RXB1D4<RXB1D40>
extern volatile __bit                   RXB1D40             __at(0x79D0);	// @ (0xF3A * 8 + 0)
#define                                 RXB1D40_bit         _BIT_ACCESS(RXB1D4,0)
// RXB1D4<RXB1D41>
extern volatile __bit                   RXB1D41             __at(0x79D1);	// @ (0xF3A * 8 + 1)
#define                                 RXB1D41_bit         _BIT_ACCESS(RXB1D4,1)
// RXB1D4<RXB1D42>
extern volatile __bit                   RXB1D42             __at(0x79D2);	// @ (0xF3A * 8 + 2)
#define                                 RXB1D42_bit         _BIT_ACCESS(RXB1D4,2)
// RXB1D4<RXB1D43>
extern volatile __bit                   RXB1D43             __at(0x79D3);	// @ (0xF3A * 8 + 3)
#define                                 RXB1D43_bit         _BIT_ACCESS(RXB1D4,3)
// RXB1D4<RXB1D44>
extern volatile __bit                   RXB1D44             __at(0x79D4);	// @ (0xF3A * 8 + 4)
#define                                 RXB1D44_bit         _BIT_ACCESS(RXB1D4,4)
// RXB1D4<RXB1D45>
extern volatile __bit                   RXB1D45             __at(0x79D5);	// @ (0xF3A * 8 + 5)
#define                                 RXB1D45_bit         _BIT_ACCESS(RXB1D4,5)
// RXB1D4<RXB1D46>
extern volatile __bit                   RXB1D46             __at(0x79D6);	// @ (0xF3A * 8 + 6)
#define                                 RXB1D46_bit         _BIT_ACCESS(RXB1D4,6)
// RXB1D4<RXB1D47>
extern volatile __bit                   RXB1D47             __at(0x79D7);	// @ (0xF3A * 8 + 7)
#define                                 RXB1D47_bit         _BIT_ACCESS(RXB1D4,7)
// RXB1D5<RXB1D50>
extern volatile __bit                   RXB1D50             __at(0x79D8);	// @ (0xF3B * 8 + 0)
#define                                 RXB1D50_bit         _BIT_ACCESS(RXB1D5,0)
// RXB1D5<RXB1D51>
extern volatile __bit                   RXB1D51             __at(0x79D9);	// @ (0xF3B * 8 + 1)
#define                                 RXB1D51_bit         _BIT_ACCESS(RXB1D5,1)
// RXB1D5<RXB1D52>
extern volatile __bit                   RXB1D52             __at(0x79DA);	// @ (0xF3B * 8 + 2)
#define                                 RXB1D52_bit         _BIT_ACCESS(RXB1D5,2)
// RXB1D5<RXB1D53>
extern volatile __bit                   RXB1D53             __at(0x79DB);	// @ (0xF3B * 8 + 3)
#define                                 RXB1D53_bit         _BIT_ACCESS(RXB1D5,3)
// RXB1D5<RXB1D54>
extern volatile __bit                   RXB1D54             __at(0x79DC);	// @ (0xF3B * 8 + 4)
#define                                 RXB1D54_bit         _BIT_ACCESS(RXB1D5,4)
// RXB1D5<RXB1D55>
extern volatile __bit                   RXB1D55             __at(0x79DD);	// @ (0xF3B * 8 + 5)
#define                                 RXB1D55_bit         _BIT_ACCESS(RXB1D5,5)
// RXB1D5<RXB1D56>
extern volatile __bit                   RXB1D56             __at(0x79DE);	// @ (0xF3B * 8 + 6)
#define                                 RXB1D56_bit         _BIT_ACCESS(RXB1D5,6)
// RXB1D5<RXB1D57>
extern volatile __bit                   RXB1D57             __at(0x79DF);	// @ (0xF3B * 8 + 7)
#define                                 RXB1D57_bit         _BIT_ACCESS(RXB1D5,7)
// RXB1D6<RXB1D60>
extern volatile __bit                   RXB1D60             __at(0x79E0);	// @ (0xF3C * 8 + 0)
#define                                 RXB1D60_bit         _BIT_ACCESS(RXB1D6,0)
// RXB1D6<RXB1D61>
extern volatile __bit                   RXB1D61             __at(0x79E1);	// @ (0xF3C * 8 + 1)
#define                                 RXB1D61_bit         _BIT_ACCESS(RXB1D6,1)
// RXB1D6<RXB1D62>
extern volatile __bit                   RXB1D62             __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 RXB1D62_bit         _BIT_ACCESS(RXB1D6,2)
// RXB1D6<RXB1D63>
extern volatile __bit                   RXB1D63             __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 RXB1D63_bit         _BIT_ACCESS(RXB1D6,3)
// RXB1D6<RXB1D64>
extern volatile __bit                   RXB1D64             __at(0x79E4);	// @ (0xF3C * 8 + 4)
#define                                 RXB1D64_bit         _BIT_ACCESS(RXB1D6,4)
// RXB1D6<RXB1D65>
extern volatile __bit                   RXB1D65             __at(0x79E5);	// @ (0xF3C * 8 + 5)
#define                                 RXB1D65_bit         _BIT_ACCESS(RXB1D6,5)
// RXB1D6<RXB1D66>
extern volatile __bit                   RXB1D66             __at(0x79E6);	// @ (0xF3C * 8 + 6)
#define                                 RXB1D66_bit         _BIT_ACCESS(RXB1D6,6)
// RXB1D6<RXB1D67>
extern volatile __bit                   RXB1D67             __at(0x79E7);	// @ (0xF3C * 8 + 7)
#define                                 RXB1D67_bit         _BIT_ACCESS(RXB1D6,7)
// RXB1D7<RXB1D70>
extern volatile __bit                   RXB1D70             __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 RXB1D70_bit         _BIT_ACCESS(RXB1D7,0)
// RXB1D7<RXB1D71>
extern volatile __bit                   RXB1D71             __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 RXB1D71_bit         _BIT_ACCESS(RXB1D7,1)
// RXB1D7<RXB1D72>
extern volatile __bit                   RXB1D72             __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 RXB1D72_bit         _BIT_ACCESS(RXB1D7,2)
// RXB1D7<RXB1D73>
extern volatile __bit                   RXB1D73             __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 RXB1D73_bit         _BIT_ACCESS(RXB1D7,3)
// RXB1D7<RXB1D74>
extern volatile __bit                   RXB1D74             __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 RXB1D74_bit         _BIT_ACCESS(RXB1D7,4)
// RXB1D7<RXB1D75>
extern volatile __bit                   RXB1D75             __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 RXB1D75_bit         _BIT_ACCESS(RXB1D7,5)
// RXB1D7<RXB1D76>
extern volatile __bit                   RXB1D76             __at(0x79EE);	// @ (0xF3D * 8 + 6)
#define                                 RXB1D76_bit         _BIT_ACCESS(RXB1D7,6)
// RXB1D7<RXB1D77>
extern volatile __bit                   RXB1D77             __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 RXB1D77_bit         _BIT_ACCESS(RXB1D7,7)
// RXB1DLC<RXB1DLC0>
extern volatile __bit                   RXB1DLC0            __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 RXB1DLC0_bit        _BIT_ACCESS(RXB1DLC,0)
// RXB1DLC<RXB1DLC1>
extern volatile __bit                   RXB1DLC1            __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 RXB1DLC1_bit        _BIT_ACCESS(RXB1DLC,1)
// RXB1DLC<RXB1DLC2>
extern volatile __bit                   RXB1DLC2            __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 RXB1DLC2_bit        _BIT_ACCESS(RXB1DLC,2)
// RXB1DLC<RXB1DLC3>
extern volatile __bit                   RXB1DLC3            __at(0x79AB);	// @ (0xF35 * 8 + 3)
#define                                 RXB1DLC3_bit        _BIT_ACCESS(RXB1DLC,3)
// RXB1EIDL<RXB1EID0>
extern volatile __bit                   RXB1EID0            __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 RXB1EID0_bit        _BIT_ACCESS(RXB1EIDL,0)
// RXB1EIDL<RXB1EID1>
extern volatile __bit                   RXB1EID1            __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 RXB1EID1_bit        _BIT_ACCESS(RXB1EIDL,1)
// RXB1EIDH<RXB1EID10>
extern volatile __bit                   RXB1EID10           __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 RXB1EID10_bit       _BIT_ACCESS(RXB1EIDH,2)
// RXB1EIDH<RXB1EID11>
extern volatile __bit                   RXB1EID11           __at(0x799B);	// @ (0xF33 * 8 + 3)
#define                                 RXB1EID11_bit       _BIT_ACCESS(RXB1EIDH,3)
// RXB1EIDH<RXB1EID12>
extern volatile __bit                   RXB1EID12           __at(0x799C);	// @ (0xF33 * 8 + 4)
#define                                 RXB1EID12_bit       _BIT_ACCESS(RXB1EIDH,4)
// RXB1EIDH<RXB1EID13>
extern volatile __bit                   RXB1EID13           __at(0x799D);	// @ (0xF33 * 8 + 5)
#define                                 RXB1EID13_bit       _BIT_ACCESS(RXB1EIDH,5)
// RXB1EIDH<RXB1EID14>
extern volatile __bit                   RXB1EID14           __at(0x799E);	// @ (0xF33 * 8 + 6)
#define                                 RXB1EID14_bit       _BIT_ACCESS(RXB1EIDH,6)
// RXB1EIDH<RXB1EID15>
extern volatile __bit                   RXB1EID15           __at(0x799F);	// @ (0xF33 * 8 + 7)
#define                                 RXB1EID15_bit       _BIT_ACCESS(RXB1EIDH,7)
// RXB1SIDL<RXB1EID16>
extern volatile __bit                   RXB1EID16           __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 RXB1EID16_bit       _BIT_ACCESS(RXB1SIDL,0)
// RXB1SIDL<RXB1EID17>
extern volatile __bit                   RXB1EID17           __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 RXB1EID17_bit       _BIT_ACCESS(RXB1SIDL,1)
// RXB1EIDL<RXB1EID2>
extern volatile __bit                   RXB1EID2            __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 RXB1EID2_bit        _BIT_ACCESS(RXB1EIDL,2)
// RXB1EIDL<RXB1EID3>
extern volatile __bit                   RXB1EID3            __at(0x79A3);	// @ (0xF34 * 8 + 3)
#define                                 RXB1EID3_bit        _BIT_ACCESS(RXB1EIDL,3)
// RXB1EIDL<RXB1EID4>
extern volatile __bit                   RXB1EID4            __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 RXB1EID4_bit        _BIT_ACCESS(RXB1EIDL,4)
// RXB1EIDL<RXB1EID5>
extern volatile __bit                   RXB1EID5            __at(0x79A5);	// @ (0xF34 * 8 + 5)
#define                                 RXB1EID5_bit        _BIT_ACCESS(RXB1EIDL,5)
// RXB1EIDL<RXB1EID6>
extern volatile __bit                   RXB1EID6            __at(0x79A6);	// @ (0xF34 * 8 + 6)
#define                                 RXB1EID6_bit        _BIT_ACCESS(RXB1EIDL,6)
// RXB1EIDL<RXB1EID7>
extern volatile __bit                   RXB1EID7            __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 RXB1EID7_bit        _BIT_ACCESS(RXB1EIDL,7)
// RXB1EIDH<RXB1EID8>
extern volatile __bit                   RXB1EID8            __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 RXB1EID8_bit        _BIT_ACCESS(RXB1EIDH,0)
// RXB1EIDH<RXB1EID9>
extern volatile __bit                   RXB1EID9            __at(0x7999);	// @ (0xF33 * 8 + 1)
#define                                 RXB1EID9_bit        _BIT_ACCESS(RXB1EIDH,1)
// RXB1SIDL<RXB1EXID>
extern volatile __bit                   RXB1EXID            __at(0x7993);	// @ (0xF32 * 8 + 3)
#define                                 RXB1EXID_bit        _BIT_ACCESS(RXB1SIDL,3)
// RXB1CON<RXB1FILHIT0>
extern volatile __bit                   RXB1FILHIT0         __at(0x7980);	// @ (0xF30 * 8 + 0)
#define                                 RXB1FILHIT0_bit     _BIT_ACCESS(RXB1CON,0)
// RXB1CON<RXB1FILHIT1>
extern volatile __bit                   RXB1FILHIT1         __at(0x7981);	// @ (0xF30 * 8 + 1)
#define                                 RXB1FILHIT1_bit     _BIT_ACCESS(RXB1CON,1)
// RXB1CON<RXB1FILHIT2>
extern volatile __bit                   RXB1FILHIT2         __at(0x7982);	// @ (0xF30 * 8 + 2)
#define                                 RXB1FILHIT2_bit     _BIT_ACCESS(RXB1CON,2)
// RXB1CON<RXB1FILHIT3>
extern volatile __bit                   RXB1FILHIT3         __at(0x7983);	// @ (0xF30 * 8 + 3)
#define                                 RXB1FILHIT3_bit     _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1FILHIT4>
extern volatile __bit                   RXB1FILHIT4         __at(0x7984);	// @ (0xF30 * 8 + 4)
#define                                 RXB1FILHIT4_bit     _BIT_ACCESS(RXB1CON,4)
// RXB1CON<RXB1FUL>
extern volatile __bit                   RXB1FUL             __at(0x7987);	// @ (0xF30 * 8 + 7)
#define                                 RXB1FUL_bit         _BIT_ACCESS(RXB1CON,7)
// PIR5<RXB1IF>
extern volatile __bit                   RXB1IF              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 RXB1IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<RXB1IP>
extern volatile __bit                   RXB1IP              __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 RXB1IP_bit          _BIT_ACCESS(IPR5,1)
// RXB1CON<RXB1M0>
extern volatile __bit                   RXB1M0              __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 RXB1M0_bit          _BIT_ACCESS(RXB1CON,5)
// RXB1CON<RXB1M1>
extern volatile __bit                   RXB1M1              __at(0x7986);	// @ (0xF30 * 8 + 6)
#define                                 RXB1M1_bit          _BIT_ACCESS(RXB1CON,6)
// COMSTAT<RXB1OVFL>
extern volatile __bit                   RXB1OVFL            __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 RXB1OVFL_bit        _BIT_ACCESS(COMSTAT,6)
// RXB1DLC<RXB1RB0>
extern volatile __bit                   RXB1RB0             __at(0x79AC);	// @ (0xF35 * 8 + 4)
#define                                 RXB1RB0_bit         _BIT_ACCESS(RXB1DLC,4)
// RXB1DLC<RXB1RB1>
extern volatile __bit                   RXB1RB1             __at(0x79AD);	// @ (0xF35 * 8 + 5)
#define                                 RXB1RB1_bit         _BIT_ACCESS(RXB1DLC,5)
// RXB1DLC<RXB1RTR>
extern volatile __bit                   RXB1RTR             __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 RXB1RTR_bit         _BIT_ACCESS(RXB1DLC,6)
// RXB1CON<RXB1RTRR0>
extern volatile __bit                   RXB1RTRR0           __at(0x7983);	// @ (0xF30 * 8 + 3)
#define                                 RXB1RTRR0_bit       _BIT_ACCESS(RXB1CON,3)
// RXB1CON<RXB1RTRRO>
extern volatile __bit                   RXB1RTRRO           __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 RXB1RTRRO_bit       _BIT_ACCESS(RXB1CON,5)
// RXB1SIDL<RXB1SID0>
extern volatile __bit                   RXB1SID0            __at(0x7995);	// @ (0xF32 * 8 + 5)
#define                                 RXB1SID0_bit        _BIT_ACCESS(RXB1SIDL,5)
// RXB1SIDL<RXB1SID1>
extern volatile __bit                   RXB1SID1            __at(0x7996);	// @ (0xF32 * 8 + 6)
#define                                 RXB1SID1_bit        _BIT_ACCESS(RXB1SIDL,6)
// RXB1SIDH<RXB1SID10>
extern volatile __bit                   RXB1SID10           __at(0x798F);	// @ (0xF31 * 8 + 7)
#define                                 RXB1SID10_bit       _BIT_ACCESS(RXB1SIDH,7)
// RXB1SIDL<RXB1SID2>
extern volatile __bit                   RXB1SID2            __at(0x7997);	// @ (0xF32 * 8 + 7)
#define                                 RXB1SID2_bit        _BIT_ACCESS(RXB1SIDL,7)
// RXB1SIDH<RXB1SID3>
extern volatile __bit                   RXB1SID3            __at(0x7988);	// @ (0xF31 * 8 + 0)
#define                                 RXB1SID3_bit        _BIT_ACCESS(RXB1SIDH,0)
// RXB1SIDH<RXB1SID4>
extern volatile __bit                   RXB1SID4            __at(0x7989);	// @ (0xF31 * 8 + 1)
#define                                 RXB1SID4_bit        _BIT_ACCESS(RXB1SIDH,1)
// RXB1SIDH<RXB1SID5>
extern volatile __bit                   RXB1SID5            __at(0x798A);	// @ (0xF31 * 8 + 2)
