MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K80/mcu.h
#define                                 TXB0D67_bit         _BIT_ACCESS(TXB0D6,7)
// TXB0D7<TXB0D70>
extern volatile __bit                   TXB0D70             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 TXB0D70_bit         _BIT_ACCESS(TXB0D7,0)
// TXB0D7<TXB0D71>
extern volatile __bit                   TXB0D71             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 TXB0D71_bit         _BIT_ACCESS(TXB0D7,1)
// TXB0D7<TXB0D72>
extern volatile __bit                   TXB0D72             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 TXB0D72_bit         _BIT_ACCESS(TXB0D7,2)
// TXB0D7<TXB0D73>
extern volatile __bit                   TXB0D73             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 TXB0D73_bit         _BIT_ACCESS(TXB0D7,3)
// TXB0D7<TXB0D74>
extern volatile __bit                   TXB0D74             __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXB0D74_bit         _BIT_ACCESS(TXB0D7,4)
// TXB0D7<TXB0D75>
extern volatile __bit                   TXB0D75             __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 TXB0D75_bit         _BIT_ACCESS(TXB0D7,5)
// TXB0D7<TXB0D76>
extern volatile __bit                   TXB0D76             __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 TXB0D76_bit         _BIT_ACCESS(TXB0D7,6)
// TXB0D7<TXB0D77>
extern volatile __bit                   TXB0D77             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 TXB0D77_bit         _BIT_ACCESS(TXB0D7,7)
// TXB0DLC<TXB0DLC0>
extern volatile __bit                   TXB0DLC0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 TXB0DLC0_bit        _BIT_ACCESS(TXB0DLC,0)
// TXB0DLC<TXB0DLC1>
extern volatile __bit                   TXB0DLC1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 TXB0DLC1_bit        _BIT_ACCESS(TXB0DLC,1)
// TXB0DLC<TXB0DLC2>
extern volatile __bit                   TXB0DLC2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 TXB0DLC2_bit        _BIT_ACCESS(TXB0DLC,2)
// TXB0DLC<TXB0DLC3>
extern volatile __bit                   TXB0DLC3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 TXB0DLC3_bit        _BIT_ACCESS(TXB0DLC,3)
// TXB0EIDL<TXB0EID0>
extern volatile __bit                   TXB0EID0            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 TXB0EID0_bit        _BIT_ACCESS(TXB0EIDL,0)
// TXB0EIDL<TXB0EID1>
extern volatile __bit                   TXB0EID1            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 TXB0EID1_bit        _BIT_ACCESS(TXB0EIDL,1)
// TXB0EIDH<TXB0EID10>
extern volatile __bit                   TXB0EID10           __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 TXB0EID10_bit       _BIT_ACCESS(TXB0EIDH,2)
// TXB0EIDH<TXB0EID11>
extern volatile __bit                   TXB0EID11           __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 TXB0EID11_bit       _BIT_ACCESS(TXB0EIDH,3)
// TXB0EIDH<TXB0EID12>
extern volatile __bit                   TXB0EID12           __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 TXB0EID12_bit       _BIT_ACCESS(TXB0EIDH,4)
// TXB0EIDH<TXB0EID13>
extern volatile __bit                   TXB0EID13           __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 TXB0EID13_bit       _BIT_ACCESS(TXB0EIDH,5)
// TXB0EIDH<TXB0EID14>
extern volatile __bit                   TXB0EID14           __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 TXB0EID14_bit       _BIT_ACCESS(TXB0EIDH,6)
// TXB0EIDH<TXB0EID15>
extern volatile __bit                   TXB0EID15           __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 TXB0EID15_bit       _BIT_ACCESS(TXB0EIDH,7)
// TXB0SIDL<TXB0EID16>
extern volatile __bit                   TXB0EID16           __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 TXB0EID16_bit       _BIT_ACCESS(TXB0SIDL,0)
// TXB0SIDL<TXB0EID17>
extern volatile __bit                   TXB0EID17           __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 TXB0EID17_bit       _BIT_ACCESS(TXB0SIDL,1)
// TXB0EIDL<TXB0EID2>
extern volatile __bit                   TXB0EID2            __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 TXB0EID2_bit        _BIT_ACCESS(TXB0EIDL,2)
// TXB0EIDL<TXB0EID3>
extern volatile __bit                   TXB0EID3            __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 TXB0EID3_bit        _BIT_ACCESS(TXB0EIDL,3)
// TXB0EIDL<TXB0EID4>
extern volatile __bit                   TXB0EID4            __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 TXB0EID4_bit        _BIT_ACCESS(TXB0EIDL,4)
// TXB0EIDL<TXB0EID5>
extern volatile __bit                   TXB0EID5            __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 TXB0EID5_bit        _BIT_ACCESS(TXB0EIDL,5)
// TXB0EIDL<TXB0EID6>
extern volatile __bit                   TXB0EID6            __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 TXB0EID6_bit        _BIT_ACCESS(TXB0EIDL,6)
// TXB0EIDL<TXB0EID7>
extern volatile __bit                   TXB0EID7            __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 TXB0EID7_bit        _BIT_ACCESS(TXB0EIDL,7)
// TXB0EIDH<TXB0EID8>
extern volatile __bit                   TXB0EID8            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 TXB0EID8_bit        _BIT_ACCESS(TXB0EIDH,0)
// TXB0EIDH<TXB0EID9>
extern volatile __bit                   TXB0EID9            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 TXB0EID9_bit        _BIT_ACCESS(TXB0EIDH,1)
// TXB0CON<TXB0ERR>
extern volatile __bit                   TXB0ERR             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 TXB0ERR_bit         _BIT_ACCESS(TXB0CON,4)
// TXB0SIDL<TXB0EXIDE>
extern volatile __bit                   TXB0EXIDE           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 TXB0EXIDE_bit       _BIT_ACCESS(TXB0SIDL,3)
// PIR5<TXB0IF>
extern volatile __bit                   TXB0IF              __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 TXB0IF_bit          _BIT_ACCESS(PIR5,2)
// IPR5<TXB0IP>
extern volatile __bit                   TXB0IP              __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 TXB0IP_bit          _BIT_ACCESS(IPR5,2)
// TXB0CON<TXB0LARB>
extern volatile __bit                   TXB0LARB            __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 TXB0LARB_bit        _BIT_ACCESS(TXB0CON,5)
// TXB0CON<TXB0PRI0>
extern volatile __bit                   TXB0PRI0            __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 TXB0PRI0_bit        _BIT_ACCESS(TXB0CON,0)
// TXB0CON<TXB0PRI1>
extern volatile __bit                   TXB0PRI1            __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 TXB0PRI1_bit        _BIT_ACCESS(TXB0CON,1)
// TXB0CON<TXB0REQ>
extern volatile __bit                   TXB0REQ             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 TXB0REQ_bit         _BIT_ACCESS(TXB0CON,3)
// TXB0DLC<TXB0RTR>
extern volatile __bit                   TXB0RTR             __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 TXB0RTR_bit         _BIT_ACCESS(TXB0DLC,6)
// TXB0SIDL<TXB0SID0>
extern volatile __bit                   TXB0SID0            __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 TXB0SID0_bit        _BIT_ACCESS(TXB0SIDL,5)
// TXB0SIDL<TXB0SID1>
extern volatile __bit                   TXB0SID1            __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 TXB0SID1_bit        _BIT_ACCESS(TXB0SIDL,6)
// TXB0SIDH<TXB0SID10>
extern volatile __bit                   TXB0SID10           __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 TXB0SID10_bit       _BIT_ACCESS(TXB0SIDH,7)
// TXB0SIDL<TXB0SID2>
extern volatile __bit                   TXB0SID2            __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 TXB0SID2_bit        _BIT_ACCESS(TXB0SIDL,7)
// TXB0SIDH<TXB0SID3>
extern volatile __bit                   TXB0SID3            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 TXB0SID3_bit        _BIT_ACCESS(TXB0SIDH,0)
// TXB0SIDH<TXB0SID4>
extern volatile __bit                   TXB0SID4            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 TXB0SID4_bit        _BIT_ACCESS(TXB0SIDH,1)
// TXB0SIDH<TXB0SID5>
extern volatile __bit                   TXB0SID5            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 TXB0SID5_bit        _BIT_ACCESS(TXB0SIDH,2)
// TXB0SIDH<TXB0SID6>
extern volatile __bit                   TXB0SID6            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 TXB0SID6_bit        _BIT_ACCESS(TXB0SIDH,3)
// TXB0SIDH<TXB0SID7>
extern volatile __bit                   TXB0SID7            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 TXB0SID7_bit        _BIT_ACCESS(TXB0SIDH,4)
// TXB0SIDH<TXB0SID8>
extern volatile __bit                   TXB0SID8            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXB0SID8_bit        _BIT_ACCESS(TXB0SIDH,5)
// TXB0SIDH<TXB0SID9>
extern volatile __bit                   TXB0SID9            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 TXB0SID9_bit        _BIT_ACCESS(TXB0SIDH,6)
// TXB1CON<TXB1ABT>
extern volatile __bit                   TXB1ABT             __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 TXB1ABT_bit         _BIT_ACCESS(TXB1CON,6)
// TXB1D0<TXB1D00>
extern volatile __bit                   TXB1D00             __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 TXB1D00_bit         _BIT_ACCESS(TXB1D0,0)
// TXB1D0<TXB1D01>
extern volatile __bit                   TXB1D01             __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 TXB1D01_bit         _BIT_ACCESS(TXB1D0,1)
// TXB1D0<TXB1D02>
extern volatile __bit                   TXB1D02             __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 TXB1D02_bit         _BIT_ACCESS(TXB1D0,2)
// TXB1D0<TXB1D03>
extern volatile __bit                   TXB1D03             __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 TXB1D03_bit         _BIT_ACCESS(TXB1D0,3)
// TXB1D0<TXB1D04>
extern volatile __bit                   TXB1D04             __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 TXB1D04_bit         _BIT_ACCESS(TXB1D0,4)
// TXB1D0<TXB1D05>
extern volatile __bit                   TXB1D05             __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 TXB1D05_bit         _BIT_ACCESS(TXB1D0,5)
// TXB1D0<TXB1D06>
extern volatile __bit                   TXB1D06             __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 TXB1D06_bit         _BIT_ACCESS(TXB1D0,6)
// TXB1D0<TXB1D07>
extern volatile __bit                   TXB1D07             __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 TXB1D07_bit         _BIT_ACCESS(TXB1D0,7)
// TXB1D1<TXB1D10>
extern volatile __bit                   TXB1D10             __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 TXB1D10_bit         _BIT_ACCESS(TXB1D1,0)
// TXB1D1<TXB1D11>
extern volatile __bit                   TXB1D11             __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 TXB1D11_bit         _BIT_ACCESS(TXB1D1,1)
// TXB1D1<TXB1D12>
extern volatile __bit                   TXB1D12             __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 TXB1D12_bit         _BIT_ACCESS(TXB1D1,2)
// TXB1D1<TXB1D13>
extern volatile __bit                   TXB1D13             __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 TXB1D13_bit         _BIT_ACCESS(TXB1D1,3)
// TXB1D1<TXB1D14>
extern volatile __bit                   TXB1D14             __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 TXB1D14_bit         _BIT_ACCESS(TXB1D1,4)
// TXB1D1<TXB1D15>
extern volatile __bit                   TXB1D15             __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 TXB1D15_bit         _BIT_ACCESS(TXB1D1,5)
// TXB1D1<TXB1D16>
extern volatile __bit                   TXB1D16             __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 TXB1D16_bit         _BIT_ACCESS(TXB1D1,6)
// TXB1D1<TXB1D17>
extern volatile __bit                   TXB1D17             __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 TXB1D17_bit         _BIT_ACCESS(TXB1D1,7)
// TXB1D2<TXB1D20>
extern volatile __bit                   TXB1D20             __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 TXB1D20_bit         _BIT_ACCESS(TXB1D2,0)
// TXB1D2<TXB1D21>
extern volatile __bit                   TXB1D21             __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 TXB1D21_bit         _BIT_ACCESS(TXB1D2,1)
// TXB1D2<TXB1D22>
extern volatile __bit                   TXB1D22             __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 TXB1D22_bit         _BIT_ACCESS(TXB1D2,2)
// TXB1D2<TXB1D23>
extern volatile __bit                   TXB1D23             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 TXB1D23_bit         _BIT_ACCESS(TXB1D2,3)
// TXB1D2<TXB1D24>
extern volatile __bit                   TXB1D24             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 TXB1D24_bit         _BIT_ACCESS(TXB1D2,4)
// TXB1D2<TXB1D25>
extern volatile __bit                   TXB1D25             __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 TXB1D25_bit         _BIT_ACCESS(TXB1D2,5)
// TXB1D2<TXB1D26>
extern volatile __bit                   TXB1D26             __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 TXB1D26_bit         _BIT_ACCESS(TXB1D2,6)
// TXB1D2<TXB1D27>
extern volatile __bit                   TXB1D27             __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 TXB1D27_bit         _BIT_ACCESS(TXB1D2,7)
// TXB1D3<TXB1D30>
extern volatile __bit                   TXB1D30             __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 TXB1D30_bit         _BIT_ACCESS(TXB1D3,0)
// TXB1D3<TXB1D31>
extern volatile __bit                   TXB1D31             __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 TXB1D31_bit         _BIT_ACCESS(TXB1D3,1)
// TXB1D3<TXB1D32>
extern volatile __bit                   TXB1D32             __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 TXB1D32_bit         _BIT_ACCESS(TXB1D3,2)
// TXB1D3<TXB1D33>
extern volatile __bit                   TXB1D33             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 TXB1D33_bit         _BIT_ACCESS(TXB1D3,3)
// TXB1D3<TXB1D34>
extern volatile __bit                   TXB1D34             __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 TXB1D34_bit         _BIT_ACCESS(TXB1D3,4)
// TXB1D3<TXB1D35>
extern volatile __bit                   TXB1D35             __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 TXB1D35_bit         _BIT_ACCESS(TXB1D3,5)
// TXB1D3<TXB1D36>
extern volatile __bit                   TXB1D36             __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 TXB1D36_bit         _BIT_ACCESS(TXB1D3,6)
// TXB1D3<TXB1D37>
extern volatile __bit                   TXB1D37             __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 TXB1D37_bit         _BIT_ACCESS(TXB1D3,7)
// TXB1D4<TXB1D40>
extern volatile __bit                   TXB1D40             __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 TXB1D40_bit         _BIT_ACCESS(TXB1D4,0)
// TXB1D4<TXB1D41>
extern volatile __bit                   TXB1D41             __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 TXB1D41_bit         _BIT_ACCESS(TXB1D4,1)
// TXB1D4<TXB1D42>
extern volatile __bit                   TXB1D42             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 TXB1D42_bit         _BIT_ACCESS(TXB1D4,2)
// TXB1D4<TXB1D43>
extern volatile __bit                   TXB1D43             __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 TXB1D43_bit         _BIT_ACCESS(TXB1D4,3)
// TXB1D4<TXB1D44>
extern volatile __bit                   TXB1D44             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 TXB1D44_bit         _BIT_ACCESS(TXB1D4,4)
// TXB1D4<TXB1D45>
extern volatile __bit                   TXB1D45             __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 TXB1D45_bit         _BIT_ACCESS(TXB1D4,5)
// TXB1D4<TXB1D46>
extern volatile __bit                   TXB1D46             __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 TXB1D46_bit         _BIT_ACCESS(TXB1D4,6)
// TXB1D4<TXB1D47>
extern volatile __bit                   TXB1D47             __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 TXB1D47_bit         _BIT_ACCESS(TXB1D4,7)
// TXB1D5<TXB1D50>
extern volatile __bit                   TXB1D50             __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 TXB1D50_bit         _BIT_ACCESS(TXB1D5,0)
// TXB1D5<TXB1D51>
extern volatile __bit                   TXB1D51             __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 TXB1D51_bit         _BIT_ACCESS(TXB1D5,1)
// TXB1D5<TXB1D52>
extern volatile __bit                   TXB1D52             __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 TXB1D52_bit         _BIT_ACCESS(TXB1D5,2)
// TXB1D5<TXB1D53>
extern volatile __bit                   TXB1D53             __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 TXB1D53_bit         _BIT_ACCESS(TXB1D5,3)
// TXB1D5<TXB1D54>
extern volatile __bit                   TXB1D54             __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 TXB1D54_bit         _BIT_ACCESS(TXB1D5,4)
// TXB1D5<TXB1D55>
extern volatile __bit                   TXB1D55             __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 TXB1D55_bit         _BIT_ACCESS(TXB1D5,5)
// TXB1D5<TXB1D56>
extern volatile __bit                   TXB1D56             __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 TXB1D56_bit         _BIT_ACCESS(TXB1D5,6)
// TXB1D5<TXB1D57>
extern volatile __bit                   TXB1D57             __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 TXB1D57_bit         _BIT_ACCESS(TXB1D5,7)
// TXB1D6<TXB1D60>
extern volatile __bit                   TXB1D60             __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 TXB1D60_bit         _BIT_ACCESS(TXB1D6,0)
// TXB1D6<TXB1D61>
extern volatile __bit                   TXB1D61             __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 TXB1D61_bit         _BIT_ACCESS(TXB1D6,1)
// TXB1D6<TXB1D62>
extern volatile __bit                   TXB1D62             __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 TXB1D62_bit         _BIT_ACCESS(TXB1D6,2)
// TXB1D6<TXB1D63>
extern volatile __bit                   TXB1D63             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 TXB1D63_bit         _BIT_ACCESS(TXB1D6,3)
// TXB1D6<TXB1D64>
extern volatile __bit                   TXB1D64             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 TXB1D64_bit         _BIT_ACCESS(TXB1D6,4)
// TXB1D6<TXB1D65>
extern volatile __bit                   TXB1D65             __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 TXB1D65_bit         _BIT_ACCESS(TXB1D6,5)
// TXB1D6<TXB1D66>
extern volatile __bit                   TXB1D66             __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 TXB1D66_bit         _BIT_ACCESS(TXB1D6,6)
// TXB1D6<TXB1D67>
extern volatile __bit                   TXB1D67             __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 TXB1D67_bit         _BIT_ACCESS(TXB1D6,7)
// TXB1D7<TXB1D70>
extern volatile __bit                   TXB1D70             __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 TXB1D70_bit         _BIT_ACCESS(TXB1D7,0)
// TXB1D7<TXB1D71>
extern volatile __bit                   TXB1D71             __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 TXB1D71_bit         _BIT_ACCESS(TXB1D7,1)
// TXB1D7<TXB1D72>
extern volatile __bit                   TXB1D72             __at(0x78EA);	// @ (0xF1D * 8 + 2)
#define                                 TXB1D72_bit         _BIT_ACCESS(TXB1D7,2)
// TXB1D7<TXB1D73>
extern volatile __bit                   TXB1D73             __at(0x78EB);	// @ (0xF1D * 8 + 3)
#define                                 TXB1D73_bit         _BIT_ACCESS(TXB1D7,3)
// TXB1D7<TXB1D74>
extern volatile __bit                   TXB1D74             __at(0x78EC);	// @ (0xF1D * 8 + 4)
#define                                 TXB1D74_bit         _BIT_ACCESS(TXB1D7,4)
// TXB1D7<TXB1D75>
extern volatile __bit                   TXB1D75             __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 TXB1D75_bit         _BIT_ACCESS(TXB1D7,5)
// TXB1D7<TXB1D76>
extern volatile __bit                   TXB1D76             __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 TXB1D76_bit         _BIT_ACCESS(TXB1D7,6)
// TXB1D7<TXB1D77>
extern volatile __bit                   TXB1D77             __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 TXB1D77_bit         _BIT_ACCESS(TXB1D7,7)
// TXB1DLC<TXB1DLC0>
extern volatile __bit                   TXB1DLC0            __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 TXB1DLC0_bit        _BIT_ACCESS(TXB1DLC,0)
// TXB1DLC<TXB1DLC1>
extern volatile __bit                   TXB1DLC1            __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 TXB1DLC1_bit        _BIT_ACCESS(TXB1DLC,1)
// TXB1DLC<TXB1DLC2>
extern volatile __bit                   TXB1DLC2            __at(0x78AA);	// @ (0xF15 * 8 + 2)
#define                                 TXB1DLC2_bit        _BIT_ACCESS(TXB1DLC,2)
// TXB1DLC<TXB1DLC3>
extern volatile __bit                   TXB1DLC3            __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 TXB1DLC3_bit        _BIT_ACCESS(TXB1DLC,3)
// TXB1EIDL<TXB1EID0>
extern volatile __bit                   TXB1EID0            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 TXB1EID0_bit        _BIT_ACCESS(TXB1EIDL,0)
// TXB1EIDL<TXB1EID1>
extern volatile __bit                   TXB1EID1            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 TXB1EID1_bit        _BIT_ACCESS(TXB1EIDL,1)
